
#Область Ссылки

// https://github.com/tporadowski/redis           - Redis 5.0.14 for Windows
// https://github.com/tporadowski/rejson          - JSON module 1.0.6 for Windows

// https://github.com/zkteco-home/redis-windows   - Redis 8.4.0 for Windows
// https://github.com/zkteco-home/RedisJson       - JSON module 2.8.0 for Windows

#КонецОбласти

#Область ПрограммныйИнтерфейс

// TODO: В случае если массив с таким ключом уже существует, то метод RPUSH в
//       функции УстановитьЗначение не создаст новое значение, а добавт элементы
//       в существующий массив. Мне представляется это некорректным поведением. Исправить!

// Создает и возвращает новое соединение с сервером Redis. При необходимости производит аутентификацию
//
// Параметры:
//  ПараметрыСоединения - Структура   - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//
// Возвращаемое значение:
//  Неопределено, Произвольный - Объект TCP клиента при успешном начале транзакции или Неопределено в случае ошибки
//
Функция ПолучитьСоединение(ПараметрыСоединения) Экспорт
	
	ОписаниеОшибки = "";
	Соединение = СоздатьСоединение(ПараметрыСоединения.Адрес, ОписаниеОшибки);
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Аутентификация(Соединение, ПараметрыСоединения.Пароль);
	
	Возврат Соединение;
	
КонецФункции

// Завершает работу соединения с сервером Redis
//
// Параметры:
//  Соединение - Произвольный - Объект TCP клиента
//
Процедура ЗакрытьСоединение(Соединение) Экспорт
	
	OPI_TCP.ЗакрытьСоединение(Соединение);
	Соединение = Неопределено;
	
КонецПроцедуры

// Проверяет доступность сервера Redis по переданным параметрам или по существующему соединению
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//
// Возвращаемое значение:
//  Булево - Истина если удалось установить соединение с сервером Redis, ложь - от сервера не был
//           получен корректный ответ
//
Функция ПроверкаДоступности(ПараметрыСоединения) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*1%1$4%1PING%1", Маркер);

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "+") Тогда 
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат ПерваяСтрокаОтвета = "+PONG";
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Устанавливает новое или изменяет существующее значение на сервере Redis с заданным ключом
// При совпадении ключей, данные с типом "Строка" перетирают массивы и хэш-таблицы (структуры
// и соответствия). Но при попытке записать хэш-таблицу поверх строки будет вызвано исключение.
// Это задокументированное поведение Redis.
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка      - Ключ с которым будет схранено значение на сервере
//  Данные              - Строка      - Строковые данные для помещения в Redis
//                      - Массив      - Массив строк
//                      - Структура   - Где:
//                          * Ключ - Строка - Имя поля хэш-таблицы
//                          * Значение - Строка - Значение поля хэш-таблицы
//                      - Соответствие - Где:
//                          * Ключ - Строка - Имя поля хэш-таблицы
//                          * Значение - Строка - Значение поля хэш-таблицы
//
// Возвращаемое значение:
//  Булево - Истина если помещение данных произведено успешно, ложь - значение не было сохранено
//
Функция УстановитьЗначение(ПараметрыСоединения, Ключ, Данные) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		Возврат УстановитьСтроку(ПараметрыСоединения, Ключ, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("Массив") Тогда
		Возврат ДобавитьЭлементыВМассив(ПараметрыСоединения, Ключ, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
		Или ТипЗнч(Данные) = Тип("Соответствие")
	Тогда
		Возврат ДобавитьЭлементыВХэшТаблицу(ПараметрыСоединения, Ключ, Данные);
	Иначе
		ВызватьИсключение СтрШаблон("Функция ""УстановитьЗначение"" не предназначена для обработки типа данных %1",
			ТипЗнч(Данные));
	КонецЕсли;
	
КонецФункции

// Возвращает значение с сервера Redis по ключу
// Если читается хэш-таблица, то имена полей будут проверены на возможность использования в
// структуре и при корректных значениях будет возвращена Структура. В противном случае - Соответствие.
// Для принудительного чтения значения в Соответствие можно использовать функцию ПолучитьХэшТаблицу
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//  Ключ                - Строка    - Ключ по которому будет запрашиваться значение с сервера
//
// Возвращаемое значение:
//  Строка, Массив, Структура, Соответствие - Значение полученное из сервера Redis.
//
Функция ПолучитьЗначение(ПараметрыСоединения, Ключ) Экспорт
	
	Попытка
		Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
			Соединение = ПолучитьСоединение(ПараметрыСоединения);
		Иначе
			Соединение = ПараметрыСоединения;
		КонецЕсли;
		
		ОписаниеТипаДанных = ТипДанных(Соединение, Ключ);
		Если ОписаниеТипаДанных = "string" Тогда
			Значение = ПолучитьСтроку(Соединение, Ключ);
		ИначеЕсли ОписаниеТипаДанных = "list" Тогда
			Значение = ПолучитьМассив(Соединение, Ключ);
		ИначеЕсли ОписаниеТипаДанных = "hash" Тогда
			Значение = ПолучитьХэшТаблицу(Соединение, Ключ);
		ИначеЕсли ОписаниеТипаДанных = "set" Тогда
			Значение = ПолучитьЭлементыМножества(Соединение, Ключ);
		ИначеЕсли ОписаниеТипаДанных = "zset" Тогда
			Значение = ПолучитьЭлементыУпорядоченногоМножества(Соединение, Ключ);
		ИначеЕсли ОписаниеТипаДанных = "ReJSON-RL" Тогда
			Значение = ПолучитьJson(Соединение, Ключ);
		Иначе // none
			Значение = Неопределено;
		КонецЕсли;
	Исключение
		Значение = Неопределено;
	КонецПопытки;
	
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		ЗакрытьСоединение(Соединение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Проверяет существование на сервере Redis записи с опреденным ключом
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//  Ключ                - Строка    - Ключ по которому будет осуществляться проверка наличия записи
//
// Возвращаемое значение:
//  Булево - Истина если запись с таким ключом существкет, ложь - запись отсутствует
//
Функция ПроверитьСуществованиеКлюча(ПараметрыСоединения, Ключ) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ для проверки наличия записи не может быть пустым.";
	КонецЕсли;
	Если Не СтрНайти(Ключ, " ") = 0 Тогда
		ВызватьИсключение "Ключ для проверки наличия записи не может содержать пробелы.";
	КонецЕсли;

	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$6%3EXISTS%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);

	РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Если СтрНачинаетсяС(РезультатВызова, ":") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", "")) = 1;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Находит все ключи на сервере Redis по заданному шаблону
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  ШаблонКлюча         - Строка    - Шаблон по которому будет осуществляться поиск ключей. Пример шаблона "user:*"
//  Асинхронно          - Булево    - Флаг используемой команды. Истина - SCAN, Ложь - KEYS
//
// Возвращаемое значение:
//  Массив - найденные ключи удовлетворяющие переданному шаблону
//
Функция НайтиКлючиПоШаблону(ПараметрыСоединения, ШаблонКлюча, Асинхронно = Истина) Экспорт

	Если ПустаяСтрока(ШаблонКлюча) Тогда
		ВызватьИсключение "Шаблон для поиска ключей значений не может быть пустым.";
	КонецЕсли;
	
	Маркер = Маркер();
	Если Асинхронно Тогда
		// TODO: По-умолчанию возвращает по 10 штук. Это явно очень мало. Поставил по 20. Да, 20 это тоже мало,
		//       но большие значения требуют "дочитывания" ответа из соединения. Слишком заморочный алгоритм
		//       получается. Если будет нужно, то потом это число можно вынести в параметр. Но пока не могу
		//       придумать сценария когд такое могло бы понадобиться
		Команда = СтрШаблон("*6%5$4%5SCAN%5$1%5%3%5$5%5MATCH%5$%2%5%1%5$5%5COUNT%5$2%5%4%5",
			ШаблонКлюча, СтрДлинаВБайтах(ШаблонКлюча), 0, "20", Маркер);
	Иначе
		Команда = СтрШаблон("*2%3$4%3KEYS%3$%2%3%1%3",
			ШаблонКлюча, СтрДлинаВБайтах(ШаблонКлюча), Маркер);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		Соединение = ПолучитьСоединение(ПараметрыСоединения);
	Иначе
		Соединение = ПараметрыСоединения;
	КонецЕсли;

	РезультатВызова = ВызовСервераRedisДляСоединения(Соединение, Команда);
	Если СтрНачинаетсяС(РезультатВызова, "*") Тогда
		
		МассивКлючей = Новый Массив;
		
		Если Асинхронно Тогда
			// У метода SCAN слегка другой ответ
			НомерПервойСтроки = 4;
			
			Курсор = СтрПолучитьСтроку(РезультатВызова, 3);
			Пока Не Курсор = "0" Цикл
				Команда = СтрШаблон("*6%6$4%6SCAN%6$%4%6%3%6$5%6MATCH%6$%2%6%1%6$5%6COUNT%6$2%6%5%6",
					ШаблонКлюча, СтрДлинаВБайтах(ШаблонКлюча),
					Курсор, СтрДлина(Курсор),
					"20", Маркер);
					
				РезультатВызоваПоКурсору = ВызовСервераRedisДляСоединения(Соединение, Команда);
				Курсор = СтрПолучитьСтроку(РезультатВызоваПоКурсору, 3);

				ДобавитьКлючиВМассивПоОтветуСКурсором(МассивКлючей, РезультатВызоваПоКурсору, НомерПервойСтроки);
			КонецЦикла;
		Иначе
			НомерПервойСтроки = 1;
		КонецЕсли;

		ДобавитьКлючиВМассивПоОтветуСКурсором(МассивКлючей, РезультатВызова, НомерПервойСтроки);
		
		Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
			ЗакрытьСоединение(Соединение);
		КонецЕсли;
		
		Возврат МассивКлючей;
		
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
			ЗакрытьСоединение(Соединение);
		КонецЕсли;

		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		ЗакрытьСоединение(Соединение);
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Удаляет значение с сервера Redis по ключу
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//  Ключ                - Строка    - Ключ по которому будет осуществляться удаление значения
//  Асинхронно          - Булево    - Флаг используемой команды. Истина - UNLINK, Ложь - DEL
//
// Возвращаемое значение:
//  Булево - Истина если удаление произведено успешно, ложь - значение с таким ключом не найдено
//
Функция УдалитьЗначение(ПараметрыСоединения, Ключ, Асинхронно = Истина) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ удаляемого значения не может быть пустым.";
	КонецЕсли;

	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$" + ?(Асинхронно, "6%3UNLINK", "3%3DEL") + "%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);

	РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Если СтрНачинаетсяС(РезультатВызова, ":") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", "")) = 1;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Возвращает тип данных на сервере Redis по ключу
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//  Ключ                - Строка    - Ключ по которому будет запрашиваться значение с сервера
//
// Возвращаемое значение:
//  Структура - Данные о результате проверки типа данных для ключа на сервере
//    * ТипДанных  - Строка       - Тип данных на сервере Redis по данному ключу. Возможные значения:
//                                  "string", "list", "hash", "json", "none"
//    * Соединение - Произвольный - Объект TCP клиента
//
// TODO:
Функция ТипДанных(ПараметрыСоединения, Ключ) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ для проверки типа записи не может быть пустым.";
	КонецЕсли;

	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$4%3TYPE%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "+") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат СтрЗаменить(ПерваяСтрокаОтвета, "+", "");
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Удаляет все ключи из всех баз данных Redis
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//  Асинхронно          - Булево    - К команде добавляется флаг ASYNC
//
// Возвращаемое значение:
//  Булево - Истина если команда выполнена успешно, ложь - ключи не были удалены
//
Функция ОчиститьВсе(ПараметрыСоединения, Асинхронно = Истина) Экспорт
	
	Маркер = Маркер();
	Если Асинхронно Тогда
		Команда = СтрШаблон("*2%1$8%1FLUSHALL%1$5%1ASYNC%1", Маркер);
	Иначе
		// Флаг SYNC для синхронного режима появился только в версии 6.2.0. Потому для совместимости не использую
		Команда = СтрШаблон("*1%1$8%1FLUSHALL%1", Маркер);
	КонецЕсли;

	// На этой команде периодически происходит подвисание сервера Redis. Моё предположение это связано
	// с операцией с файлом БД. Он пересоздаётся и записывается заново. Потому вот такой костыль.
	СчПопыток = 0;
	Пока Истина Цикл
		Попытка
			РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
			Если СтрНачинаетсяС(РезультатВызова, "+") Тогда
				ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
				Возврат ПерваяСтрокаОтвета = "+OK";
			КонецЕсли;
			Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
				ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
			КонецЕсли;
			
			ВызватьИсключение РезультатВызова;
		Исключение
			СчПопыток = СчПопыток + 1;
			Если СчПопыток > 5 Тогда
				Прервать;
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
	
	Если СчПопыток > 5 Тогда
		ВызватьИсключение "Не удалось выполнить действие очистки БД Redis";
	КонецЕсли;

КонецФункции

// Возвращает оставшееся время жизни (ttl) значения на сервере Redis
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ              - Строка         - Ключ для которого будет получено оставшееся время жизни значения на сервере
//
// Возвращаемое значение:
//  Число, Неопределено - Оставшееся время жизни значения на сервере Redis в секундах. 0 - время жизни для
//                        значения не установлено.
//
Функция ПолучитьВремяЖизни(ПараметрыСоединения, Ключ) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ для получения оставшегося времени жизни записи не может быть пустым.";
	КонецЕсли;
	
	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$3%3TTL%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);
		
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	
	Если СтрНачинаетсяС(РезультатВызова, ":-1") Тогда
		Возврат 0;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":-2") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", ""));
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Устанавливает время жизни (ttl) значения на сервере Redis
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ для которого будет установлено время жизни значения в секундах
//  ВремяЖизни          - Число        - Время жизни значения на сервере Redis в секундах
//
// Возвращаемое значение:
//  Булево - Истина если обновление времени жизни значения произведено успешно, ложь - время жизни не было обновлено
//
Функция УстановитьВремяЖизни(ПараметрыСоединения, Ключ, ВремяЖизни) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ для установки времени жизни записи не может быть пустым.";
	КонецЕсли;

	Если ВремяЖизни < 0 Тогда
		_ВремяЖизни = "0";
	Иначе
		_ВремяЖизни = Формат(ВремяЖизни, "ЧН=; ЧГ=0");
	КонецЕсли;
	
	Маркер = Маркер();
	Команда = СтрШаблон("*3%5$6%5EXPIRE%5$%2%5%1%5$%4%5%3%5",
		Ключ, СтрДлинаВБайтах(Ключ),
		_ВремяЖизни, СтрДлина(_ВремяЖизни),
		Маркер);

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", "")) = 1;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "+QUEUED") Тогда
		Возврат Истина;
	КонецЕсли;

	ВызватьИсключение РезультатВызова;

КонецФункции

#Область РаботаСоСтрокой

// Устанавливает новое или изменят существующее значение строкового типа на сервере Redis
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка    - Ключ с которым будет схранено значение на сервере
//  Данные              - Строка    - Строковые данные для помещения в Redis
//  ВремяЖизни          - Число     - Время жизни значения на сервере Redis в секундах
//
// Возвращаемое значение:
//  Булево - Истина если помещение данных произведено успешно, ложь - значение не было сохранено
//
Функция УстановитьСтроку(ПараметрыСоединения, Ключ, Данные, ВремяЖизни = 0) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ сохраняемого значения не может быть пустым.";
	КонецЕсли;
	
	Если ВремяЖизни < 0 Тогда
		_ВремяЖизни = "0";
	Иначе
		_ВремяЖизни = Формат(ВремяЖизни, "ЧН=; ЧГ=0");
	КонецЕсли;

	Маркер = Маркер();
	Если _ВремяЖизни = "0" Тогда
		Команда = СтрШаблон("*3%5$3%5SET%5$%2%5%1%5$%4%5%3%5",
			Ключ, СтрДлинаВБайтах(Ключ), Данные, СтрДлинаВБайтах(Данные),
			Маркер);
	Иначе
		Команда = СтрШаблон("*4%7$3%7SET%7$%2%7%1%7$%4%7%3%7$2%7EX%7%6%7%5%7",
			Ключ, СтрДлинаВБайтах(Ключ),
			Данные, СтрДлинаВБайтах(Данные),
			_ВремяЖизни, СтрДлина(_ВремяЖизни),
			Маркер);
	КонецЕсли;

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	
	Если СтрНачинаетсяС(РезультатВызова, "+") Тогда 
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат ПерваяСтрокаОтвета = "+OK";
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;

	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Получает строковое значение с сервера Redis по ключу
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ по которому будет запрашиваться значение с сервера
//  ЗакрыватьСоединение - Булево       - 
//
// Возвращаемое значение:
//  Строка - Значение полученное из сервера Redis
//
Функция ПолучитьСтроку(ПараметрыСоединения, Ключ, ЗакрыватьСоединение = Истина) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ получаемой строки не может быть пустым.";
	КонецЕсли;

	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$3%3GET%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
		Если ЗакрыватьСоединение Тогда
			OPI_TCP.ЗакрытьСоединение(ПараметрыСоединения);
		КонецЕсли;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "$") Тогда
		Если СтрНачинаетсяС(РезультатВызова, "$-1") Тогда
			Возврат Неопределено;
		Иначе
			Результат = "";
			ЧислоСтрок = СтрЧислоСтрок(РезультатВызова);
			Для Сч = 2 По ЧислоСтрок Цикл
				Результат = Результат + СтрПолучитьСтроку(РезультатВызова, Сч) +
					?(Сч < ЧислоСтрок, Маркер, "");
			КонецЦикла;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;

КонецФункции

#КонецОбласти

#Область РаботаСМассивом

// Добавляет элементы в массив на сервере Redis. В случае если массива с таким ключом не существует,
// то создаёт новое значение
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//  Ключ                - Строка    - Ключ по которому будет запрашиваться значение с сервера
//  Данные              - Массив    - Данные для помещения в Redis
//  МестоДобавления     - Строка    - Признак, добавляются элементы "ВНачало" массива или "ВКонец"
//
// Возвращаемое значение:
//  Булево - Истина если помещение данных произведено успешно, ложь - значение не было сохранено
//
Функция ДобавитьЭлементыВМассив(ПараметрыСоединения, Ключ, Данные, МестоДобавления = "ВКонец") Экспорт

	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ сохраняемого значения не может быть пустым.";
	КонецЕсли;
	Если Не ВозможнаСериализация(Данные) Тогда
		ВызватьИсключение "Переданные данные невозможно поместиь в Redis.";
	КонецЕсли;
	Если Данные.Количество() = 0 Тогда
		ВызватьИсключение "Массив должен содержать хотя бы одну строку.";
	КонецЕсли;
	
	КоличествоДобавленныхЭлементов = 0;
	
	Маркер = Маркер();
	КоличествоЭлементов = Данные.Количество();
	РазмерБлока = 1000; // Большие массивы бьём блоками по 1 000 элементов. На каком-то форуме прочитал
	
	ОстатокЭлементовВПоследнемБлоке = (КоличествоЭлементов % РазмерБлока);
	Блоков = Цел(КоличествоЭлементов / РазмерБлока) + ?(ОстатокЭлементовВПоследнемБлоке > 0, 1, 0);
	
	ОписаниеОшибки = "";
		
	Соединение = СоздатьСоединение(ПараметрыСоединения.Адрес, ОписаниеОшибки);
	Если Соединение = Неопределено И Не ПустаяСтрока(ОписаниеОшибки) Тогда
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;

	Аутентификация(Соединение, ПараметрыСоединения.Пароль);
	
	Если Блоков > 1 Тогда
		НачатьТранзакциюRedis(Соединение);
		Если ТипЗнч(Соединение) = Тип("Строка") Тогда
			ВызватьИсключение Соединение;
		КонецЕсли;
	КонецЕсли;
	
	Для Сч = 0 По Блоков - 1 Цикл
		
		СчетчикЭлементовВОчередномБлоке = ?(Сч = Блоков - 1,
			Сч * РазмерБлока + ?(ОстатокЭлементовВПоследнемБлоке = 0, РазмерБлока, ОстатокЭлементовВПоследнемБлоке),
			Сч * РазмерБлока + РазмерБлока);
		
		КоличествоЭлементовБлока = СчетчикЭлементовВОчередномБлоке - Сч * РазмерБлока;
		НачалоКоманды = СтрШаблон("*%1%4$5%4" + ?(МестоДобавления = "ВКонец", "RPUSH", "LPUSH") + "%4$%3%4%2%4",
			Формат(КоличествоЭлементовБлока + 2, "ЧН=; ЧГ=0"),
			Ключ, СтрДлинаВБайтах(Ключ), Маркер);
		
		МассивДляСозданияКоманды = Новый Массив;
		МассивДляСозданияКоманды.Добавить(НачалоКоманды);
			
		Для СчВнутриБлока = Сч * РазмерБлока По СчетчикЭлементовВОчередномБлоке - 1 Цикл
			
			ЭлементМассива = Данные.Получить(СчВнутриБлока);
			ДлинаЭлементаМассива = СтрДлинаВБайтах(ЭлементМассива);
			ЧастьКоманды = СтрШаблон("$%2%3%1%3",
				ЭлементМассива, Формат(ДлинаЭлементаМассива, "ЧН=; ЧГ=0"),
				Маркер);
			МассивДляСозданияКоманды.Добавить(ЧастьКоманды);
			
		КонецЦикла;
			
		Команда = СтрСоединить(МассивДляСозданияКоманды, "");

		РезультатВызова = ВызовСервераRedisДляСоединения(Соединение, Команда);
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Если (СтрНачинаетсяС(ПерваяСтрокаОтвета, ":")
				И Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", "")) = КоличествоДобавленныхЭлементов + КоличествоЭлементовБлока)
			Или (Блоков > 1 И СтрНачинаетсяС(ПерваяСтрокаОтвета, "+QUEUED")) Тогда
			
			КоличествоДобавленныхЭлементов = КоличествоДобавленныхЭлементов + КоличествоЭлементовБлока;
			
		ИначеЕсли СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
			ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
		Иначе
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если Блоков > 1 Тогда
		РезультатЗавершенияТранзакции = ЗафиксироватьТранзакциюRedis(Соединение);
		Если Не ПустаяСтрока(РезультатЗавершенияТранзакции) Тогда
			ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатЗавершенияТранзакции, 1);
			КоличествоКомандВТранзакции = Число(СтрЗаменить(ПерваяСтрокаОтвета, "*", ""));
			Если Не Блоков = КоличествоКомандВТранзакции Тогда
				ВызватьИсключение РезультатЗавершенияТранзакции;
			КонецЕсли;
			// TODO: Проконтролировать количество добавленных элементов?
		КонецЕсли;
	Иначе
		OPI_TCP.ЗакрытьСоединение(Соединение);
	КонецЕсли;
	
	Если КоличествоДобавленныхЭлементов = КоличествоЭлементов Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Возвращает массив строк с сервера Redis по ключу
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ по которому будет запрашиваться значение с сервера
//  ЗакрыватьСоединение - Булево       - 
//
// Возвращаемое значение:
//  Массив - Значение полученное из сервера Redis
//
Функция ПолучитьМассив(ПараметрыСоединения, Ключ, ЗакрыватьСоединение = Истина) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ получаемого массива не может быть пустым.";
	КонецЕсли;
	
	Маркер = Маркер();
	Команда = СтрШаблон("*4%3$6%3LRANGE%3$%2%3%1%3$1%3%4%3$2%3-1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер, 0);
		
	ОписаниеОшибки = "";
	
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		
		Соединение = СоздатьСоединение(ПараметрыСоединения.Адрес, ОписаниеОшибки);
		Если Соединение = Неопределено И Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;

		Аутентификация(Соединение, ПараметрыСоединения.Пароль);
		
	Иначе
		Соединение = ПараметрыСоединения;
	КонецЕсли;
	
	РегулярноеВыражениеДляПоиска = "^\$\d*$";
	
	РезультатВызова = ВызовСервераRedisДляСоединения(Соединение, Команда);
	Если СтрНачинаетсяС(РезультатВызова, "*") Тогда
		
		ПерваяСтрока = СтрПолучитьСтроку(РезультатВызова, 1);
		ЧислоЭлементовRedis = Число(СтрЗаменить(ПерваяСтрока, "*", ""));
		// TODO: Придумать способ сделать то же самое без регулярных выражений.
		//       Т.к. их использование увеличивает время обработки и повышает необходимую версию платформы 1С
		ЧислоЗначенийRedis = СтрНайтиВсеПоРегулярномуВыражению(РезультатВызова,
			РегулярноеВыражениеДляПоиска,, Истина).Количество();
		
		// Не всё было принято в первом ответе. Надо дополнительно читать из соединения
		Пока Не ЧислоЗначенийRedis = ЧислоЭлементовRedis Цикл
			
			РезультатЧтения = OPI_TCP.ПрочитатьСтроку(Соединение,, Маркер);
			РезультатЧтенияОшибка = OPI_TCP.ПолучитьПоследнююОшибку(Соединение);
			Если ВыполнениеЗавершилосьОшибкой(РезультатЧтенияОшибка, ОписаниеОшибки) Тогда
				
				OPI_TCP.ЗакрытьСоединение(Соединение);
				
				ВызватьИсключение ОписаниеОшибки;
				
			КонецЕсли;
			
			РезультатВызова = РезультатВызова + РезультатЧтения;
			ЧислоЗначенийRedis = СтрНайтиВсеПоРегулярномуВыражению(РезультатВызова,
				РегулярноеВыражениеДляПоиска,, Истина).Количество();
			
		КонецЦикла;

		Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Или ЗакрыватьСоединение Тогда
			OPI_TCP.ЗакрытьСоединение(Соединение);
		КонецЕсли;
		
		Возврат РазобратьОтветRedisКакМассив(РезультатВызова);
	
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;

	OPI_TCP.ЗакрытьСоединение(Соединение);
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Возвращает количество строк в массиве БД Redis
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//  Ключ                - Строка    - Ключ по которому будет запрашиваться значение с сервера
//
// Возвращаемое значение:
//  Число, Неопределено - количество элментов в массиве. Неопределено - когда ключ в БД Redis отсутствует
//
Функция КоличествоСтрокМассива(ПараметрыСоединения, Ключ) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$4%3LLEN%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-WRONGTYPE") Тогда
		// Если значение для ключа не массив это не нормальная ситуация. Будет вызвано исключение
		// только с более вменяемым текстом
		ВызватьИсключение СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся массивом", Ключ);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":0") Тогда
		// Массивов с нулевым количеством строк в Redis быть не может. То что вернулось "0"
		// означает что значения с таким ключом нет в БД. Возвращать "0" всё равно не буду
		// для единообразия ответов с функцией ПолучитьСтрокуМассива
		Возврат Неопределено;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", ""));
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Возвращает значение строки массива в БД Redis по номеру строки
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//  Ключ                - Строка    - Ключ по которому будет запрашиваться значение с сервера
//  НомерСтроки         - Число     - Номер получаемой строки
//
// Возвращаемое значение:
//  Строка, Неопределено - значение элемента массива. Неопределено - когда ключ в БД Redis отсутствует
//
Функция ПолучитьСтрокуМассива(ПараметрыСоединения, Ключ, НомерСтроки) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*3%5$6%5LINDEX%5$%2%5%1%5$%4%5%3%5",
		Ключ, СтрДлинаВБайтах(Ключ),
		Формат(НомерСтроки, "ЧН=; ЧГ=0"), Формат(СтрДлина(НомерСтроки), "ЧН=; ЧГ=0"),
		Маркер);

	РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Если СтрНачинаетсяС(РезультатВызова, "-WRONGTYPE") Тогда
		// Если значение для ключа не массив это не нормальная ситуация. Будет вызвано исключение
		// только с более вменяемым текстом
		ВызватьИсключение СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся массивом", Ключ);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "$") Тогда
		Если СтрНачинаетсяС(РезультатВызова, "$-1") Тогда
			// При некорректном номере строки и при отсутствующем в БД ключе возврат от Redis
			// одинаковый. Так что разделить ответы для этих двух ситуаций не могу
			Возврат Неопределено;
		Иначе
			Результат = "";
			ЧислоСтрок = СтрЧислоСтрок(РезультатВызова);
			Для Сч = 2 По ЧислоСтрок Цикл
				Результат = Результат + СтрПолучитьСтроку(РезультатВызова, Сч) +
					?(Сч < ЧислоСтрок, Маркер, "");
			КонецЦикла;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Удаляет строки массива с сервера Redis по найденным значениям
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента
//  Ключ                - Строка       - Ключ по которому будет запрашиваться массив с сервера
//  НаправлениеУдаления - Число        - Управляет количеством удаляемых элементов и направлением операции.
//                                       Если значение больше 0, то удаляет указанное количество первых
//                                         найденных элементов.
//                                       Если значение меньше 0, то удаляет указанное количество воследних найденных
//                                         элементов.
//                                       Если значение равно 0, то удаляет все найденные элементы
//  ЗначениеЭлемента    - Строка       - Значение для поиска строк которые будут удалены
//
// Возвращаемое значение:
//  Число - Количество строк которые были удалены
//
Функция УдалитьСтрокиМассива(ПараметрыСоединения, Ключ, НаправлениеУдаления, ЗначениеЭлемента) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*4%7$4%7LREM%7$%2%7%1%7$%6%7%5%7$%4%7%3%7",
		Ключ, СтрДлинаВБайтах(Ключ),
		ЗначениеЭлемента, СтрДлинаВБайтах(ЗначениеЭлемента),
		Формат(НаправлениеУдаления, "ЧН=; ЧГ=0"), Формат(СтрДлина(НаправлениеУдаления), "ЧН=; ЧГ=0"),
		Маркер);

	РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Если СтрНачинаетсяС(РезультатВызова, "-WRONGTYPE") Тогда
		// Если значение для ключа не массив это не нормальная ситуация. Будет вызвано исключение
		// только с более вменяемым текстом
		ВызватьИсключение СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся массивом", Ключ);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", ""));
	КонецЕсли;

	ВызватьИсключение РезультатВызова;
	
КонецФункции

// TODO: Реализовать LPOP

#КонецОбласти

#Область РаботаСХэшТаблицей

//
//
Функция ДобавитьЭлементыВХэшТаблицу(ПараметрыСоединения, Ключ, Данные) Экспорт

	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ сохраняемого значения не может быть пустым.";
	КонецЕсли;
	Если Не ВозможнаСериализация(Данные) Тогда
		ВызватьИсключение "Переданные данные невозможно поместиь в Redis.";
	КонецЕсли;
	
	КоличествоЗначащихПолей = 0;
	Для каждого КлючЗначение Из Данные Цикл
		Если КлючЗначение.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоЗначащихПолей = КоличествоЗначащихПолей + 1;
	КонецЦикла;
	Если КоличествоЗначащихПолей = 0 Тогда
		ВызватьИсключение ?(ТипЗнч(Данные) = Тип("Структура"), "Структура должна", "Соответствие должно") +
			" содержать хотя бы одно значение.";
	КонецЕсли;
	
	Маркер = Маркер();
	Команда = СтрШаблон("*%1%4$4%4HSET%4$%3%4%2%4",
		Формат(КоличествоЗначащихПолей * 2 + 2, "ЧН=; ЧГ=0"),
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);

	Для каждого КлючЗначение Из Данные Цикл
		Если КлючЗначение.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Команда = Команда + СтрШаблон("$%2%5%1%5$%4%5%3%5",
			КлючЗначение.Ключ, СтрДлинаВБайтах(КлючЗначение.Ключ),
			КлючЗначение.Значение, СтрДлинаВБайтах(КлючЗначение.Значение),
			Маркер);
	КонецЦикла;

	РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
	Если Не СтрНачинаетсяС(ПерваяСтрокаОтвета, "-")
		// Здесь поставил условием любое число. Даже ноль. Т.к. элементы в хэшах могут
		// не только добавляться, но и обновляться. А возвращается количество новых (добавленных)
		И Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", "")) >= 0 Тогда 
			
		Возврат Истина;
		
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;

	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Возвращает хэш-таблицу с сервера Redis по ключу
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ по которому будет запрашиваться значение с сервера
//  СохранятьВСтруктуру - Булево       - Признак того, что данные необходимо по возможности
//                                       сохранить в Структуру. Иначе функция вернёт Соответствие.
//  ЗакрыватьСоединение - Булево       - 
//
// Возвращаемое значение:
//  Структура, Соответствие - Значение полученное из сервера Redis
//
Функция ПолучитьХэшТаблицу(ПараметрыСоединения, Ключ, СохранятьВСтруктуру = Истина,
	ЗакрыватьСоединение = Истина) Экспорт
	
	Если ПустаяСтрока(Ключ) Тогда
		ВызватьИсключение "Ключ получаемой хэш-таблицы не может быть пустым.";
	КонецЕсли;

	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$7%3HGETALL%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);
		
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
		Если ЗакрыватьСоединение Тогда
			OPI_TCP.ЗакрытьСоединение(ПараметрыСоединения);
		КонецЕсли;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "*") Тогда
		
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		КоличествоЭлементов = Число(СтрЗаменить(ПерваяСтрокаОтвета, "*", ""));
		
		Результат = Новый Соответствие;
		Для Сч = 1 По КоличествоЭлементов / 2 Цикл
			Результат.Вставить(СтрПолучитьСтроку(РезультатВызова, Сч * 4 - 1),
				СтрПолучитьСтроку(РезультатВызова, Сч * 4 + 1));
		КонецЦикла;
		
		Если СохранятьВСтруктуру И ВозможноСохранениеВСтруктуру(Результат) Тогда
			РезультатСтруктура = Новый Структура;
			Для каждого КлючЗначение Из Результат Цикл
				РезультатСтруктура.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
			
			Результат = РезультатСтруктура;
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-NOAUTH") Тогда
		ВызватьИсключение "Требуется задать параметры аутентификации для сервера Redis";
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Возвращает количество полей в хэш-таблице БД Redis
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ по которому будет запрашиваться количество полей с сервера
//
// Возвращаемое значение:
//  Число - количество полей в хэш-таблице
//
Функция КоличествоПолейХэшТаблицы(ПараметрыСоединения, Ключ) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$4%3HLEN%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-WRONGTYPE") Тогда
		// Если значение для ключа не хэш-таблица это не нормальная ситуация. Будет вызвано исключение
		// только с более вменяемым текстом
		ВызватьИсключение СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся хэш-таблицей", Ключ);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":0") Тогда
		// Хэш-таблиц с нулевым количеством полей в Redis быть не может. То что вернулось "0"
		// означает что значения с таким ключом нет в БД. Возвращать "0" всё равно не буду
		// для единообразия ответов с функцией ПолучитьСтрокуМассива
		Возврат Неопределено;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", ""));
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Возвращает массив наименований полей с сервера Redis по ключу
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ по которому будет запрашиваться поля с сервера
//
// Возвращаемое значение:
//  Массив - наименования полей хэш-таблицы
//
Функция ПоляХэшТаблицы(ПараметрыСоединения, Ключ) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*2%3$5%3HKEYS%3$%2%3%1%3",
		Ключ, СтрДлинаВБайтах(Ключ), Маркер);

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-WRONGTYPE") Тогда
		// Если значение для ключа не хэш-таблица это не нормальная ситуация. Будет вызвано исключение
		// только с более вменяемым текстом
		ВызватьИсключение СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся хэш-таблицей", Ключ);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "*") Тогда
		
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		КоличествоЭлементов = Число(СтрЗаменить(ПерваяСтрокаОтвета, "*", ""));
		
		Результат = Новый Массив;
		Для Сч = 1 По КоличествоЭлементов Цикл
			Результат.Добавить(СтрПолучитьСтроку(РезультатВызова, Сч * 2 + 1));
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Возвращает значение поля хэш-таблицы в БД Redis по наименованию поля
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ по которому будет запрашиваться значение поля с сервера
//  Поле                - Строка       - Наименование поля для получения значения
//
// Возвращаемое значение:
//  Строка - значение поля хэш-таблицы
Функция ЗначениеПоляХэшТаблицы(ПараметрыСоединения, Ключ, Поле) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*3%5$4%5HGET%5$%2%5%1%5$%4%5%3%5",
		Ключ, СтрДлинаВБайтах(Ключ),
		Поле, СтрДлинаВБайтах(Поле),
		Маркер);

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-WRONGTYPE") Тогда
		// Если значение для ключа не хэш-таблица это не нормальная ситуация. Будет вызвано исключение
		// только с более вменяемым текстом
		ВызватьИсключение СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся хэш-таблицей", Ключ);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "$") Тогда
		
		Если СтрНачинаетсяС(РезультатВызова, "$-1") Тогда
			Возврат Неопределено;
		Иначе
			Результат = "";
			ЧислоСтрок = СтрЧислоСтрок(РезультатВызова);
			Для Сч = 2 По ЧислоСтрок Цикл
				Результат = Результат + СтрПолучитьСтроку(РезультатВызова, Сч) +
					?(Сч < ЧислоСтрок, Маркер, "");
			КонецЦикла;
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

// Удаляет поля хэш-таблицы с сервера Redis по перечню полей
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ по которому будет произведено удаление полей с сервера
//  Поля                - Массив       - Массив наименований удаляемых полей
//
// Возвращаемое значение:
//  Число - количество полей которые были удалены
//
Функция УдалитьПоляХэшТаблицы(ПараметрыСоединения, Ключ, Поля) Экспорт
	
	Маркер = Маркер();
	КоличествоПолей = Поля.Количество();
	
	Команда = СтрШаблон("*%3%4$4%4HDEL%4$%2%4%1%4",
		Ключ, СтрДлинаВБайтах(Ключ), Формат(КоличествоПолей + 2, "ЧН=; ЧГ=0"), Маркер);
		
	Для Сч = 0 По КоличествоПолей - 1 Цикл
		Команда = Команда + СтрШаблон("$%2%3%1%3", Поля[Сч], СтрДлинаВБайтах(Поля[Сч]), Маркер);
	КонецЦикла;

	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-WRONGTYPE") Тогда
		// Если значение для ключа не хэш-таблица это не нормальная ситуация. Будет вызвано исключение
		// только с более вменяемым текстом
		ВызватьИсключение СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся хэш-таблицей", Ключ);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, ":") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", ""));
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
		
КонецФункции

#КонецОбласти

#Область РаботаСJson

// Устанавливает JSON значение для ключа. Данные помещаются в корень JSON
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента
//  Ключ                - Строка       - Ключ по которому будет схранены данные на сервере
//  Данные              - Строка       - Данные для записи в БД Redis
//                      - Число        - 
//                      - ЗаписьJSON   - 
//
// Возвращаемое значение:
//  Булево - Истина если помещение данных произведено успешно, ложь - значение не было сохранено
//
Функция УстановитьJson(ПараметрыСоединения, Ключ, Данные) Экспорт
	
	Возврат УстановитьJsonДляПути(ПараметрыСоединения, Ключ, Данные);
	
КонецФункции

// Устанавливает JSON значение для ключа по конкретному пути JSON. Путь должен существовать
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента
//  Ключ                - Строка       - Ключ по которому будет схранены данные на сервере
//  Данные              - Строка       - Данные для записи в БД Redis
//                      - Число        - 
//                      - ЗаписьJSON   - 
//  Путь                - Строка       - Путь для установки данных. Элементы пути отделяются друг от друга точкой
//
// Возвращаемое значение:
//  Булево - Истина если помещение данных произведено успешно, ложь - значение не было сохранено
//
Функция УстановитьJsonДляПути(ПараметрыСоединения, Ключ, Данные, Путь = "") Экспорт
	
	Если ТипЗнч(Данные) = Тип("ЗаписьJSON") Тогда
		СтрокаJson = Данные.Закрыть();
	Иначе // Строка, Число
		СтрокаJson = Строка(Данные);
	КонецЕсли;
	
	Если ПустаяСтрока(Путь) Тогда
		ВремПуть = ".";
	Иначе
		МассивЭлементовПути = СтрРазделить(Путь, ".");
		ВремПуть = "$.[""" + СтрСоединить(МассивЭлементовПути, """].[""") + """]";
	КонецЕсли;
	
	Маркер = Маркер();
	Команда = СтрШаблон("*4%7$8%7JSON.SET%7$%2%7%1%7$%4%7%3%7$%6%7%5%7",
		Ключ, СтрДлинаВБайтах(Ключ),
		ВремПуть, СтрДлинаВБайтах(ВремПуть),
		СтрокаJson, СтрДлинаВБайтах(СтрокаJson),
		Маркер);
		
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "+") Тогда
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
		Возврат ПерваяСтрокаОтвета = "+OK";
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "$-1")
		Или СтрНачинаетсяС(РезультатВызова, "-ERR") Тогда
		
		ВызватьИсключение СтрШаблон("Для значения %1 не определен путь %2", Ключ, Путь);
		
	КонецЕсли;
	
	ВызватьИсключение "Неизвестная ошибка работы с Redis JSON";
	
КонецФункции

// Возвращает JSON значение для ключа. Данные запрашиваются из корня JSON
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента
//  Ключ                - Строка       - Ключ по которому будет прочитаны данные на сервере
//
// Возвращаемое значение:
//  ЧтениеJSON - 
Функция ПолучитьJson(ПараметрыСоединения, Ключ) Экспорт
	
	Возврат ПолучитьJsonДляПути(ПараметрыСоединения, Ключ);
	
КонецФункции

// Возвращает JSON значение для ключа по конкретному пути JSON. Путь должен существовать
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента
//  Ключ                - Строка       - Ключ по которому будет прочитаны данные на сервере
//  Путь                - Строка       - Путь для получения данных. Элементы пути отделяются друг от друга точкой
//
// Возвращаемое значение:
//  ЧтениеJSON - 
//
Функция ПолучитьJsonДляПути(ПараметрыСоединения, Ключ, Путь = "") Экспорт

	Если ПустаяСтрока(Путь) Тогда
		ВремПуть = ".";
	Иначе
		МассивЭлементовПути = СтрРазделить(Путь, ".");
		ВремПуть = ".[""" + СтрСоединить(МассивЭлементовПути, """].[""") + """]";
	КонецЕсли;

	Маркер = Маркер();
	Команда = СтрШаблон("*3%5$8%5JSON.GET%5$%2%5%1%5$%4%5%3%5",
		Ключ, СтрДлинаВБайтах(Ключ),
		ВремПуть, СтрДлинаВБайтах(ВремПуть),
		Маркер);
		
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "$-1") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "-ERR") Тогда
		ВызватьИсключение СтрШаблон("Для значения %1 не определен путь %2", Ключ, Путь);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "$") Тогда
		СтрокаJson = СтрПолучитьСтроку(РезультатВызова, 2);
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(СтрокаJson);
		
		Возврат ЧтениеJSON;
	КонецЕсли;

	ВызватьИсключение "Неизвестная ошибка работы с Redis JSON";
	
КонецФункции

#КонецОбласти

#Область РаботаСТранзакциями

// Начинает транзакцию и возвращает соединение с сервером Redis для добавления в транзакцию команд
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//
// Возвращаемое значение:
//  Строка, Произвольный - Объект TCP клиента при успешном начале транзакции или информацию об ошибке
//
Функция НачатьТранзакциюRedis(ПараметрыСоединения) Экспорт
	
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		ОписаниеОшибки = "";
		Соединение = СоздатьСоединение(ПараметрыСоединения.Адрес, ОписаниеОшибки);
		Если Соединение = Неопределено И Не ПустаяСтрока(ОписаниеОшибки) Тогда
			Возврат ОписаниеОшибки;
		КонецЕсли;
		
		Аутентификация(Соединение, ПараметрыСоединения.Пароль);
	Иначе
		Соединение = ПараметрыСоединения;
	КонецЕсли;
	
	Маркер = Маркер();
	Команда = СтрШаблон("*1%1$5%1MULTI%1", Маркер);
	
	РезультатВызова = ВызовСервераRedisДляСоединения(Соединение, Команда);
	ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
	Если Не ПерваяСтрокаОтвета = "+OK" Тогда
		Возврат РезультатВызова;
	КонецЕсли;
	
	Возврат Соединение;
	
КонецФункции

// Фиксирует транзакцию и закрывает соединение с сервером Redis
//
// Параметры:
//  Соединение - Произвольный - объект TCP клиента, см. НачатьТранзакциюRedis
//
// Возвращаемое значение:
//  Строка - Результат выполнения фиксации транзакции
//
Функция ЗафиксироватьТранзакциюRedis(Соединение) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*1%1$4%1EXEC%1", Маркер);
	
	РезультатВызова = ВызовСервераRedisДляСоединения(Соединение, Команда);
	
	OPI_TCP.ЗакрытьСоединение(Соединение);

	Возврат РезультатВызова;
	
КонецФункции

#КонецОбласти

#Область РаботаСМножествами

//
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//
// Возвращаемое значение:
//
//
Функция ПолучитьЭлементыМножества(ПараметрыСоединения, Ключ) Экспорт
	
	// TODO:
	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область РаботаСУпорядоченнымиМножествами

// Добавляет элементы с указанными оценками в упорядоченное множество для заданного ключа
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - Ключ по которому будут схранены данные на сервере
//  Данные              - Массив Из Структура:
//                          * Оценка   - Число  - Целое положительное число по значению которого будет
//                                                проводится упорядочивание элементов множества
//                          * Значение - Строка - Значение элемента множества
//
// Возвращаемое значение:
//  Булево - 
//
Функция ДобавитьЭлементыВУпорядоченноеМножество(ПараметрыСоединения, Ключ, Данные) Экспорт

	ФорматнаяСтрокаДляЧисла = "ЧН=; ЧГ=0";

	Маркер = Маркер();
	Команда = СтрШаблон("*%1%4$4%4ZADD%4$%3%4%2%4",
		Формат(Данные.Количество() * 2 + 2, ФорматнаяСтрокаДляЧисла),
		Ключ, СтрДлинаВБайтах(Ключ),
		Маркер);
		
	Для каждого ЭлементМножества Из Данные Цикл
		ОценкаСтрокой = Формат(ЭлементМножества.Оценка, ФорматнаяСтрокаДляЧисла);
		Команда = Команда + СтрШаблон("$%2%5%1%5$%4%5%3%5",
			ОценкаСтрокой, Формат(СтрДлина(ОценкаСтрокой), ФорматнаяСтрокаДляЧисла),
			ЭлементМножества.Значение, СтрДлинаВБайтах(ЭлементМножества.Значение),
			Маркер);
	КонецЦикла;
	
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
	Если СтрНачинаетсяС(ПерваяСтрокаОтвета, ":")
		И Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", "")) = Данные.Количество() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ВызватьИсключение РезультатВызова;
	
КонецФункции

//
//
// Параметры:
//  ПараметрыСоединения - Структура    - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный - Объект TCP клиента когда команда вызывается для ранее
//                                       установленного соединения
//  Ключ                - Строка       - 
//  Начало              - Число        - 
//  Конец               - Число        - 
//  СОценкой            - Булево       - 
//
// Возвращаемое значение:
//
//
Функция ПолучитьЭлементыУпорядоченногоМножества(ПараметрыСоединения, Ключ, Начало = 0, Конец = -1,
	СОценкой = Ложь) Экспорт
	
	ФорматнаяСтрокаДляЧисла = "ЧН=; ЧГ=0";

	Маркер = Маркер();
	Команда = СтрШаблон("*4%7$6%7ZRANGE%7$%2%7%1%7$%4%7%3%7$%6%7%5%7",
		Ключ, СтрДлинаВБайтах(Ключ),
		Формат(Начало, ФорматнаяСтрокаДляЧисла), Формат(СтрДлина(Начало), ФорматнаяСтрокаДляЧисла),
		Формат(Конец, ФорматнаяСтрокаДляЧисла), Формат(СтрДлина(Конец), ФорматнаяСтрокаДляЧисла),
		Маркер);
		
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	Если СтрНачинаетсяС(РезультатВызова, "*") Тогда
		
		Поля = "";
		Если СОценкой Тогда
			Поля = "Значение, Оценка";
		КонецЕсли;
		
		Возврат РазобратьОтветRedisКакМассив(РезультатВызова, Поля);
		
	КонецЕсли;

	ВызватьИсключение РезультатВызова;
	
КонецФункции

//
//
// Параметры:
//  ПараметрыСоединения - Структура        - Параметры для подключения
//                          * Адрес  - Строка - Адрес сервера Redis
//                          * Пароль - Строка - Пароль для подключения к серверу Redis
//                      - Произвольный     - Объект TCP клиента когда команда вызывается для ранее
//                                           установленного соединения
//  Ключ                - Строка           - 
//  Данные              - Массив Из Строка - 
//
// Возвращаемое значение:
//
//
Функция УдалитьЭлементыИзУпорядоченногоМножества(ПараметрыСоединения, Ключ, Данные) Экспорт
	
	Маркер = Маркер();
	Команда = СтрШаблон("*%1%4$4%4ZREM%4$%3%4%2%4",
		Формат(Данные.Количество() + 2, "ЧН=; ЧГ=0"),
		Ключ, СтрДлинаВБайтах(Ключ),
		Маркер);
		
	Для каждого ЗначениеМножества Из Данные Цикл
		Команда = Команда + СтрШаблон("$%2%3%1%3",
			ЗначениеМножества, Формат(СтрДлина(ЗначениеМножества), "ЧН=; ЧГ=0"),
			Маркер);
	КонецЦикла;
	
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		РезультатВызова = ВызовСервераRedis(ПараметрыСоединения, Команда);
	Иначе
		РезультатВызова = ВызовСервераRedisДляСоединения(ПараметрыСоединения, Команда);
	КонецЕсли;
	ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, 1);
	Если СтрНачинаетсяС(ПерваяСтрокаОтвета, ":")
		И Число(СтрЗаменить(ПерваяСтрокаОтвета, ":", "")) = Данные.Количество() Тогда
		
		Возврат Истина;
		
	КонецЕсли;

	ВызватьИсключение РезультатВызова;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьСоединение(АдресСервераRedis, ОписаниеОшибки)

	Соединение = OPI_TCP.ОткрытьСоединение(АдресСервераRedis);
	Если ВыполнениеЗавершилосьОшибкой(Соединение, ОписаниеОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Соединение;

КонецФункции

Процедура Аутентификация(Соединение, Пароль)
	
	Если Не ПустаяСтрока(Пароль) Тогда
		Маркер = Маркер();
		Команда = СтрШаблон("*2%3$4%3AUTH%3$%2%3%1%3",
			Пароль, СтрДлинаВБайтах(Пароль),
			Маркер);
		
		РезультатАутентификации = ВызовСервераRedisДляСоединения(Соединение, Команда);
		ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатАутентификации, 1);
		Если Не ПерваяСтрокаОтвета = "+OK" Тогда
			ВызватьИсключение РезультатАутентификации;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ВызовСервераRedis(ПараметрыСоединения, Команда)
	
	ОписаниеОшибки = "";
		
	Соединение = СоздатьСоединение(ПараметрыСоединения.Адрес, ОписаниеОшибки);
	Если Соединение = Неопределено И Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат ОписаниеОшибки;
	КонецЕсли;
	
	Аутентификация(Соединение, ПараметрыСоединения.Пароль);
	
	РезультатВызова = ВызовСервераRedisДляСоединения(Соединение, Команда);
	
	OPI_TCP.ЗакрытьСоединение(Соединение);
	
	Возврат РезультатВызова;
	
КонецФункции

Функция ВызовСервераRedisДляСоединения(Соединение, Команда)

	ОписаниеОшибки = "";
	Маркер = Маркер();

	OPI_TCP.ОтправитьСтроку(Соединение, Команда);
	РезультатОтправкиОшибка = OPI_TCP.ПолучитьПоследнююОшибку(Соединение);
	Если ВыполнениеЗавершилосьОшибкой(РезультатОтправкиОшибка, ОписаниеОшибки) Тогда
		OPI_TCP.ЗакрытьСоединение(Соединение);
		Возврат ОписаниеОшибки;
	КонецЕсли;
	
	РезультатЧтения = OPI_TCP.ПрочитатьСтроку(Соединение,, Маркер);
	РезультатЧтенияОшибка = OPI_TCP.ПолучитьПоследнююОшибку(Соединение);
	Если ВыполнениеЗавершилосьОшибкой(РезультатЧтенияОшибка, ОписаниеОшибки) Тогда
		OPI_TCP.ЗакрытьСоединение(Соединение);
		Возврат ОписаниеОшибки;
	КонецЕсли;

	Возврат РезультатЧтения;
	
КонецФункции

Функция ВыполнениеЗавершилосьОшибкой(Объект, ОписаниеОшибки)
	
	Если ТипЗнч(Объект) = Тип("Соответствие")
		И Не Объект.Получить("error") = Неопределено Тогда

		ОписаниеОшибки = Объект.Получить("error");
		Возврат Истина;
		
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ВозможнаСериализация(Данные)
	
	ТипСтрока = Тип("Строка");

	Если ТипЗнч(Данные) = ТипСтрока Тогда
		Возврат Истина;
	ИначеЕсли ТипЗнч(Данные) = Тип("Массив") Тогда
		Для каждого ЭлементМассива Из Данные Цикл
			Если Не ТипЗнч(ЭлементМассива) = ТипСтрока Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Истина;
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
		Или ТипЗнч(Данные) = Тип("Соответствие") Тогда
		
		Для каждого КлючЗначение Из Данные Цикл
			Если Не ТипЗнч(КлючЗначение.Ключ) = ТипСтрока
				Или (Не ТипЗнч(КлючЗначение.Значение) = ТипСтрока И Не ТипЗнч(КлючЗначение.Значение) = Тип("Неопределено"))
			Тогда

				Возврат Ложь;
				
			КонецЕсли;
		КонецЦикла;

		Возврат Истина;
	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция СтрДлинаВБайтах(Стр)
	Возврат Формат(ДлинаВБайтах(Стр), "ЧН=; ЧГ=0");
КонецФункции

Функция ДлинаВБайтах(Стр)
	ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(Стр, КодировкаТекста.UTF8);
	Возврат ДвоичныеДанные.Размер();
КонецФункции

// Не стал использовать никаких регулярных выражений для совместимости
Функция ВозможноСохранениеВСтруктуру(Данные)
	
	ПервыеСимволы = "abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя_";
	ОстальныеСимволы = ПервыеСимволы + "0123456789";
	
	Для каждого КлючЗначение Из Данные Цикл
		Если СтрНайти(ПервыеСимволы, НРег(Лев(КлючЗначение.Ключ, 1))) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		Для Сч = 2 По СтрДлина(КлючЗначение.Ключ) Цикл
			Если СтрНайти(ОстальныеСимволы, НРег(Сред(КлючЗначение.Ключ, Сч, 1))) = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Маркер()
	
	Возврат Символы.ВК + Символы.ПС;
	
КонецФункции

// TODO: Доделать обработку параметра ПоляЭлементаМассива
Функция РазобратьОтветRedisКакМассив(РезультатВызоваRedis, ПоляЭлементаМассива = "")
	
	ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызоваRedis, 1);
	КоличествоЭлементов = Число(СтрЗаменить(ПерваяСтрокаОтвета, "*", ""));
	
	СмещениеДляМногострочнхСтрок = 0;
	
	Результат = Новый Массив;
	МассивСтрок = СтрРазделить(РезультатВызоваRedis, Символы.ПС + Символы.ВК, Ложь);
	Для Сч = 1 По КоличествоЭлементов Цикл
		
		ИндексЭлемента = Сч*2 + СмещениеДляМногострочнхСтрок;
		
		ЗначениеЭлементаМассива = МассивСтрок.Получить(ИндексЭлемента);
		ДлинаЗначенияЭлемента = Число(СтрЗаменить(МассивСтрок.Получить(ИндексЭлемента - 1), "$", ""));
		Пока ДлинаЗначенияЭлемента > ДлинаВБайтах(ЗначениеЭлементаМассива) Цикл
			
			СмещениеДляМногострочнхСтрок = СмещениеДляМногострочнхСтрок + 1;
			ИндексЭлемента = Сч*2 + СмещениеДляМногострочнхСтрок;
			
			ЗначениеЭлементаМассива = ЗначениеЭлементаМассива + Символы.ПС + МассивСтрок.Получить(ИндексЭлемента);
			
		КонецЦикла;
		
		Результат.Добавить(ЗначениеЭлементаМассива);
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКлючиВМассивПоОтветуСКурсором(МассивКлючей, РезультатВызова, НомерПервойСтроки)

	ПерваяСтрокаОтвета = СтрПолучитьСтроку(РезультатВызова, НомерПервойСтроки);
	ЧислоКлючей = Число(СтрЗаменить(ПерваяСтрокаОтвета, "*", ""));
	Для Сч = 1 По ЧислоКлючей Цикл
		МассивКлючей.Добавить(СтрПолучитьСтроку(РезультатВызова, Сч * 2 + НомерПервойСтроки));
	КонецЦикла;

КонецПроцедуры

#КонецОбласти