
#Область ОбъявлениеТестов

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("Redis: Инфраструктура")
			.ДобавитьТест("НедоступностьСервера")
		.ДобавитьТестовыйНабор("Redis: Общие")
			.ДобавитьТест("УстановитьИПолучитьЗначение_Строку")
			.ДобавитьТест("УстановитьИПолучитьЗначение_Массив")
			.ДобавитьТест("УстановитьИПолучитьЗначение_МассивСМногострочнымиЗначениями")
			.ДобавитьТест("УстановитьИПолучитьЗначение_Структуру")
			.ДобавитьТест("УстановитьИПолучитьЗначение_Соответствие")
			.ДобавитьТест("ПолучитьЗначениеОтсутствующегоКлюча")
			.ДобавитьТест("ПроверитьСуществованиеКлюча_КлючСуществует")
			.ДобавитьТест("ПроверитьСуществованиеКлюча_КлючОтсутствует")
			.ДобавитьТест("НайтиКлючиПоШаблону")
			.ДобавитьТест("НайтиКлючиПоШаблону_БольшоеКоличествоКлючей")
				.Перед("Перед_НайтиКлючиПоШаблону_БольшоеКоличествоКлючей")
				.СПараметрами(Ложь)
				.СПараметрами(Истина)
			.ДобавитьТест("УдалитьЗначение")
			.ДобавитьТест("УдалитьЗначениеОтсутствующегоКлюча")
			.ДобавитьТест("ТипДанных_Строка")
			.ДобавитьТест("ТипДанных_Массив")
			.ДобавитьТест("ТипДанных_ХэшТаблица")
			.ДобавитьТест("ТипДанныхОтсутствующегоКлюча")
			.ДобавитьТест("ОчиститьВсе_Синхронно")
			.ДобавитьТест("ОчиститьВсе_Асинхронно")
			.ДобавитьТест("УстановитьВремяЖизни")
			.ДобавитьТест("ПолучитьВремяЖизни")
				.Перед("Перед_ПолучитьВремяЖизни")
			.ДобавитьТест("ПолучитьНеЗаданноеВремяЖизни")
			.ДобавитьТест("УстановитьВремяЖизниОтсутствующегоКлюча")
			.ДобавитьТест("ПолучитьВремяЖизниОтсутствующегоКлюча")
		.ДобавитьТестовыйНабор("Redis: Строка")
			.ДобавитьТест("УстановитьСтроку")
			.ДобавитьТест("ПолучитьСтроку")
		.ДобавитьТестовыйНабор("Redis: Массив")
			.ДобавитьТест("ДобавитьЭлементыВМассив_ВКонец")
			.ДобавитьТест("ДобавитьЭлементыВМассив_ВНачало")
			.ДобавитьТест("ПолучитьМассив")
			.ДобавитьТест("КоличествоСтрокМассива_НормальныйВызов")
			.ДобавитьТест("КоличествоСтрокМассива_КлючНеЗадан")
			.ДобавитьТест("КоличествоСтрокМассива_ЗначениеНеМассив")
			.ДобавитьТест("ПолучитьСтрокуМассива_НормальныйВызов")
			.ДобавитьТест("ПолучитьСтрокуМассива_КлючНеЗадан")
			.ДобавитьТест("ПолучитьСтрокуМассива_ЗначениеНеМассив")
			.ДобавитьТест("ПолучитьСтрокуМассива_НекорретныйИндекс")
			.ДобавитьТест("УдалитьСтрокиМассива_ОднаСтрока")
			.ДобавитьТест("УдалитьСтрокиМассива_НесколькоСтрок")
			.ДобавитьТест("УдалитьСтрокиМассива_НечегоУдалять")
			.ДобавитьТест("СоздатьБольшойМассив")
				.Перед("Перед_СоздатьБольшойМассив")
				.СПараметрами(1053)
				.СПараметрами(2000)
				.СПараметрами(50000)
				.СПараметрами(100000)
			.ДобавитьТест("ПолучитьБольшойМассив")
				.Перед("Перед_ПолучитьБольшойМассив")
				.СПараметрами(1053)
				.СПараметрами(2000)
				.СПараметрами(50000)
				.СПараметрами(100000)
		.ДобавитьТестовыйНабор("Redis: Хэш-таблица")
			.ДобавитьТест("СохранитьХэшТаблицуСПустымиЗначениями_ОдноПустое")
			.ДобавитьТест("СохранитьХэшТаблицуСПустымиЗначениями_ВсеПустые")
			.ДобавитьТест("ПолучитьХэшТаблицу")
			.ДобавитьТест("КоличествоПолейХэшТаблицы")
			.ДобавитьТест("ПоляХэшТаблицы")
			.ДобавитьТест("ЗначениеПоляХэшТаблицы")
			.ДобавитьТест("УдалитьПоляХэшТаблицы")
		.ДобавитьТестовыйНабор("Redis: Json")
			.ДобавитьТест("УстановитьИПолучитьJson")
			.ДобавитьТест("УстановитьИПолучитьМногострочныйJson")
			.ДобавитьТест("УстановитьJsonДляПути_Число")
			.ДобавитьТест("УстановитьJsonДляПути_Структура")
			.ДобавитьТест("УстановитьJsonДляПути_КореньОтсутствует_Число")
			.ДобавитьТест("УстановитьJsonДляПути_КореньОтсутствует_Структура")
			.ДобавитьТест("УстановитьJsonДляПути_ГлубокаяВложенность_Число")
			.ДобавитьТест("УстановитьJsonДляПути_ГлубокаяВложенностьОтсутствует_Число")
			.ДобавитьТест("ПолучитьJsonДляПути")
			.ДобавитьТест("ПолучитьJsonДляПути_КореньОтсутствует")
			.ДобавитьТест("ПолучитьJsonДляПути_ГлубокаяВложенностьОтсутствует")
		.ДобавитьТестовыйНабор("Redis: Транзакции")
		.ДобавитьТестовыйНабор("Redis: Streams")
		.ДобавитьТестовыйНабор("Redis: Упорядоченные множества")
			.ДобавитьТест("ДобавитьПолучитьЭлементыМножества")
			.ДобавитьТест("УдалитьЭлементыМножества")
	;
	
КонецПроцедуры

#КонецОбласти

#Область События

Процедура ПередКаждымТестом() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияКСерверуRedis();
	
	Redis_ОсновныеФункции.ОчиститьВсе(ПараметрыПодключенияКСерверуRedis);

	// Сохраняю адрес сервера и пароль в настройки
	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("Адрес", ПараметрыПодключенияКСерверуRedis.Адрес);
	Контекст.Вставить("Пароль", ПараметрыПодключенияКСерверуRedis.Пароль);
	
КонецПроцедуры

Процедура Перед_НайтиКлючиПоШаблону_БольшоеКоличествоКлючей() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияКСерверуRedis();

	Redis_ОсновныеФункции.ОчиститьВсе(ПараметрыПодключенияКСерверуRedis);
	
	Соединение = Redis_ОсновныеФункции.ПолучитьСоединение(ПараметрыПодключенияКСерверуRedis);

	Для Сч = 1 По 100000 Цикл
		
		РезультатУстановки1 = Redis_ОсновныеФункции.УстановитьЗначение(Соединение,
			СтрШаблон("ТестовыйКлюч:%1", Формат(Сч, "ЧГ=")),
			СтрШаблон("ТестовоеЗначение%1", Формат(Сч, "ЧГ=")));
		
	КонецЦикла;
		
	Redis_ОсновныеФункции.ЗакрытьСоединение(Соединение);
	
	// Сохраняю адрес сервера и пароль в настройки
	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("Адрес", ПараметрыПодключенияКСерверуRedis.Адрес);
	Контекст.Вставить("Пароль", ПараметрыПодключенияКСерверуRedis.Пароль);
	
КонецПроцедуры

// Выделил в отдельную процедуру чтобы ожидание в 5 сек. не попало в оценку времени самого теста
Процедура Перед_ПолучитьВремяЖизни() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияКСерверуRedis();
	
	Redis_ОсновныеФункции.ОчиститьВсе(ПараметрыПодключенияКСерверуRedis);
	
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	ВремяЖизниСек = 10;
	
	Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	Redis_ОсновныеФункции.УстановитьВремяЖизни(ПараметрыПодключенияКСерверуRedis, Ключ, ВремяЖизниСек);
	
	ЮТест.Пауза(3);
	
	// Сохраняю адрес сервера и пароль в настройки
	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("Адрес", ПараметрыПодключенияКСерверуRedis.Адрес);
	Контекст.Вставить("Пароль", ПараметрыПодключенияКСерверуRedis.Пароль);

КонецПроцедуры

Процедура Перед_СоздатьБольшойМассив() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияКСерверуRedis();

	Redis_ОсновныеФункции.ОчиститьВсе(ПараметрыПодключенияКСерверуRedis);
	
	Данные = Новый Массив;
	Для Сч = 1 По ЮТест.ОписаниеТекущегоТеста().Параметры[0] Цикл
		Данные.Добавить(Строка(Новый УникальныйИдентификатор));
	КонецЦикла;
	
	ЮТест.Контекст().УстановитьЗначение("Данные", Данные);
	
	// Сохраняю адрес сервера и пароль в настройки
	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("Адрес", ПараметрыПодключенияКСерверуRedis.Адрес);
	Контекст.Вставить("Пароль", ПараметрыПодключенияКСерверуRedis.Пароль);

КонецПроцедуры

Процедура Перед_ПолучитьБольшойМассив() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияКСерверуRedis();
	
	Redis_ОсновныеФункции.ОчиститьВсе(ПараметрыПодключенияКСерверуRedis);
	
	ТестовыйМассив = Новый Массив;
	Для Сч = 1 По ЮТест.ОписаниеТекущегоТеста().Параметры[0] Цикл
		ТестовыйМассив.Добавить(Строка(Новый УникальныйИдентификатор));
	КонецЦикла;
	
	Ключ = "ТестовыйМассив";

	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	ЮТест.Контекст().УстановитьЗначение("РезультатУстановки", РезультатУстановки);

	// Сохраняю адрес сервера и пароль в настройки
	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("Адрес", ПараметрыПодключенияКСерверуRedis.Адрес);
	Контекст.Вставить("Пароль", ПараметрыПодключенияКСерверуRedis.Пароль);
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

#Область Инфраструктура

Процедура НедоступностьСервера() Экспорт

	ПараметрыПодключения = Новый Структура("Адрес, Пароль",
		"localhost:6380", "");
	
	ЮТест.ОжидаетЧто(Redis_ОсновныеФункции)
		.Метод("УстановитьЗначение")
			.Параметр(ПараметрыПодключения)
			.Параметр("ТестоваяСтрока")
			.Параметр("ТестовоеЗначение")
		.ВыбрасываетИсключение("Direct connection error: Подключение не установлено, т.к. конечный компьютер отверг запрос на подключение. (os error 10061)")
	;
	
КонецПроцедуры

#КонецОбласти

#Область Общие

Процедура УстановитьИПолучитьЗначение_Строку() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Строка")
		.Равно(ТестоваяСтрока)
	;
	
КонецПроцедуры

Процедура УстановитьИПолучитьЗначение_Массив() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	ТестовыйМассив.Добавить("ЗначениеМассива2");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(2)
	;
	
КонецПроцедуры

Процедура УстановитьИПолучитьЗначение_МассивСМногострочнымиЗначениями() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначенияМассива1:
	|	Строка1_1,
	|	Строка1_2");
	ТестовыйМассив.Добавить("ЗначениеМассива2:
	|	Строка2_1,
	|	Строка2_2,
	|	Строка2_3");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(2)
		.Содержит(ТестовыйМассив[0])
		.Содержит(ТестовыйМассив[1])
	;
	
КонецПроцедуры

Процедура УстановитьИПолучитьЗначение_Структуру() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтруктура";

	ТестоваяСтруктура = Новый Структура;
	ТестоваяСтруктура.Вставить("КлючСтруктуры1", "ЗначениеСтруктуры1");
	ТестоваяСтруктура.Вставить("КлючСтруктуры2", "ЗначениеСтруктуры2");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтруктура);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;
	
	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Структура")
		.ИмеетДлину(2)
	;
	
КонецПроцедуры

Процедура УстановитьИПолучитьЗначение_Соответствие() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовоеСоответствие";

	ТестовоеСоответствие = Новый Соответствие;
	ТестовоеСоответствие.Вставить("1-йКлюч", "ЗначениеСоответствия1");
	ТестовоеСоответствие.Вставить("2-йКлюч", "ЗначениеСоответствия2");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовоеСоответствие);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;
	
	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Соответствие")
		.ИмеетДлину(2)
	;
	
КонецПроцедуры

Процедура ПолучитьЗначениеОтсутствующегоКлюча() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	
	// Специально ничего не записываю в Redis
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатПолучения)
		.Равно(Неопределено)
	;
	
КонецПроцедуры

Процедура ПроверитьСуществованиеКлюча_КлючСуществует() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	
	РезультатПроверки = Redis_ОсновныеФункции.ПроверитьСуществованиеКлюча(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПроверки)
		.ЭтоИстина()
	;
	
КонецПроцедуры

Процедура ПроверитьСуществованиеКлюча_КлючОтсутствует() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	
	// Специально ничего не записываю в Redis
	
	РезультатПроверки = Redis_ОсновныеФункции.ПроверитьСуществованиеКлюча(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатПроверки)
		.ЭтоЛожь()
	;
	
КонецПроцедуры

Процедура НайтиКлючиПоШаблону() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	
	РезультатУстановки1 = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, "ТестовыйКлюч:1", "ТестовоеЗначение1");
	РезультатУстановки2 = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, "ТестовыйКлюч:2", "ТестовоеЗначение2");
	РезультатУстановки3 = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, "НеподходящийКлюч", "ЗначениеНеподходящегоКлюча");
	
	РезультатПроверки = Redis_ОсновныеФункции.НайтиКлючиПоШаблону(ПараметрыПодключенияКСерверуRedis, "ТестовыйКлюч:*");
	
	ЮТест.ОжидаетЧто(РезультатУстановки1)
		.ЭтоИстина()
	;
	ЮТест.ОжидаетЧто(РезультатУстановки2)
		.ЭтоИстина()
	;
	ЮТест.ОжидаетЧто(РезультатУстановки3)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПроверки)
		.ИмеетТип("Массив")
		.ИмеетДлину(2)
	;
	
КонецПроцедуры

Процедура НайтиКлючиПоШаблону_БольшоеКоличествоКлючей(Асинхронно) Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();

	РезультатПроверки = Redis_ОсновныеФункции.НайтиКлючиПоШаблону(ПараметрыПодключенияКСерверуRedis, "*", Асинхронно);
	
	ЮТест.ОжидаетЧто(РезультатПроверки)
		.ИмеетТип("Массив")
		.ИмеетДлину(100000)
	;
	
КонецПроцедуры

Процедура УдалитьЗначение() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	
	РезультатКонтроляДоУдаления = Redis_ОсновныеФункции.ПроверитьСуществованиеКлюча(ПараметрыПодключенияКСерверуRedis, Ключ);

	РезультатУдаления = Redis_ОсновныеФункции.УдалитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);

	РезультатКонтроляПослеУдаления = Redis_ОсновныеФункции.ПроверитьСуществованиеКлюча(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатКонтроляДоУдаления)
		.ЭтоИстина()
	;
	
	ЮТест.ОжидаетЧто(РезультатУдаления)
		.ЭтоИстина()
	;
	
	ЮТест.ОжидаетЧто(РезультатКонтроляПослеУдаления)
		.ЭтоЛожь()
	;
	
КонецПроцедуры

Процедура УдалитьЗначениеОтсутствующегоКлюча() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";

	// Специально ничего не записываю в Redis
	
	РезультатКонтроляДоУдаления = Redis_ОсновныеФункции.ПроверитьСуществованиеКлюча(ПараметрыПодключенияКСерверуRedis, Ключ);

	РезультатУдаления = Redis_ОсновныеФункции.УдалитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатКонтроляДоУдаления)
		.ЭтоЛожь()
	;

	ЮТест.ОжидаетЧто(РезультатУдаления)
		.ЭтоЛожь()
	;
	
КонецПроцедуры

Процедура ТипДанных_Строка() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	
	РезультатПолучения = Redis_ОсновныеФункции.ТипДанных(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Строка")
		.Равно("string")
	;
	
КонецПроцедуры

Процедура ТипДанных_Массив() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);
	
	РезультатПолучения = Redis_ОсновныеФункции.ТипДанных(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Строка")
		.Равно("list")
	;
	
КонецПроцедуры

Процедура ТипДанных_ХэшТаблица() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтруктура";

	ТестоваяСтруктура = Новый Структура;
	ТестоваяСтруктура.Вставить("КлючСтруктуры1", "ЗначениеСтруктуры1");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтруктура);
	
	РезультатПолучения = Redis_ОсновныеФункции.ТипДанных(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Строка")
		.Равно("hash")
	;
	
КонецПроцедуры

Процедура ТипДанныхОтсутствующегоКлюча() Экспорт
	
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	
	// Специально ничего не записываю в Redis
	
	РезультатПолучения = Redis_ОсновныеФункции.ТипДанных(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Строка")
		.Равно("none")
	;

КонецПроцедуры

Процедура ОчиститьВсе_Синхронно() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	
	РезультатПолученияДоОчистки = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	РезультатОчистки = Redis_ОсновныеФункции.ОчиститьВсе(ПараметрыПодключенияКСерверуRedis, Ложь);

	РезультатПолученияПослеОчистки = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолученияДоОчистки)
		.ИмеетТип("Строка")
		.Равно(ТестоваяСтрока)
	;

	ЮТест.ОжидаетЧто(РезультатОчистки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолученияПослеОчистки)
		.Равно(Неопределено)
	;
	
КонецПроцедуры

Процедура ОчиститьВсе_Асинхронно() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	
	РезультатПолученияДоОчистки = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	РезультатОчистки = Redis_ОсновныеФункции.ОчиститьВсе(ПараметрыПодключенияКСерверуRedis);

	РезультатПолученияПослеОчистки = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолученияДоОчистки)
		.ИмеетТип("Строка")
		.Равно(ТестоваяСтрока)
	;

	ЮТест.ОжидаетЧто(РезультатОчистки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолученияПослеОчистки)
		.Равно(Неопределено)
	;
	
КонецПроцедуры

Процедура УстановитьВремяЖизни() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	ВремяЖизниСек = 10;
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	
	РезультатУстановкиВремениЖизни = Redis_ОсновныеФункции.УстановитьВремяЖизни(ПараметрыПодключенияКСерверуRedis, Ключ, ВремяЖизниСек);

	РезультатПолученияВремениЖизни = Redis_ОсновныеФункции.ПолучитьВремяЖизни(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатУстановкиВремениЖизни)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолученияВремениЖизни)
		.ИмеетТип("Число")
		.Равно(ВремяЖизниСек)
	;
	
КонецПроцедуры

Процедура ПолучитьВремяЖизни() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";

	РезультатПолученияВремениЖизни = Redis_ОсновныеФункции.ПолучитьВремяЖизни(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатПолученияВремениЖизни)
		.ИмеетТип("Число")
		.Равно(7) // см.процедуру Перед_ПолучитьВремяЖизни 10 (установил) - 3 (ждать) = 7 сек.
	;
	
КонецПроцедуры

Процедура ПолучитьНеЗаданноеВремяЖизни() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);
	
	// Пропускаю процедуру установки времени жизни
	
	РезультатПолученияВремениЖизни = Redis_ОсновныеФункции.ПолучитьВремяЖизни(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолученияВремениЖизни)
		.ИмеетТип("Число")
		.Равно(0)
	;
	
КонецПроцедуры

Процедура УстановитьВремяЖизниОтсутствующегоКлюча() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	
	// Специально ничего не записываю в Redis
	
	РезультатУстановкиВремениЖизни = Redis_ОсновныеФункции.УстановитьВремяЖизни(ПараметрыПодключенияКСерверуRedis, Ключ, 10);

	ЮТест.ОжидаетЧто(РезультатУстановкиВремениЖизни)
		.ЭтоЛожь()
	;
	
КонецПроцедуры

Процедура ПолучитьВремяЖизниОтсутствующегоКлюча() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	
	// Специально ничего не записываю в Redis
	
	РезультатПолученияВремениЖизни = Redis_ОсновныеФункции.ПолучитьВремяЖизни(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатПолученияВремениЖизни)
		.Равно(Неопределено)
	;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСтроками

Процедура УстановитьСтроку() Экспорт

	// TODO:

КонецПроцедуры

Процедура ПолучитьСтроку() Экспорт

	// TODO:

КонецПроцедуры

#КонецОбласти

#Область РаботаСМассивами

Процедура ДобавитьЭлементыВМассив_ВКонец() Экспорт

	// TODO:

КонецПроцедуры

Процедура ДобавитьЭлементыВМассив_ВНачало() Экспорт

	// TODO:

КонецПроцедуры

Процедура ПолучитьМассив() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	ТестовыйМассив.Добавить("ЗначениеМассива2");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьМассив(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(2)
	;
	
КонецПроцедуры

Процедура КоличествоСтрокМассива_НормальныйВызов() Экспорт

	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	ТестовыйМассив.Добавить("ЗначениеМассива2");
	ТестовыйМассив.Добавить("ЗначениеМассива3");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатПолучения = Redis_ОсновныеФункции.КоличествоСтрокМассива(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Число")
		.Равно(3)
	;

КонецПроцедуры

Процедура КоличествоСтрокМассива_КлючНеЗадан() Экспорт

	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	// Специально ничего не записываю в Redis
	
	РезультатПолучения = Redis_ОсновныеФункции.КоличествоСтрокМассива(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.Равно(Неопределено)
	;

КонецПроцедуры

Процедура КоличествоСтрокМассива_ЗначениеНеМассив() Экспорт

	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);

	// Получение данных из Redis не описываю т.к. для данных условий предусмотрено вызов исключения

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(Redis_ОсновныеФункции)
		.Метод("КоличествоСтрокМассива")
			.Параметр(ПараметрыПодключенияКСерверуRedis)
			.Параметр(Ключ)
		.ВыбрасываетИсключение(СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся массивом", Ключ))
	;

КонецПроцедуры

Процедура ПолучитьСтрокуМассива_НормальныйВызов() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	ТестовыйМассив.Добавить("ЗначениеМассива2");
	ТестовыйМассив.Добавить("ЗначениеМассива3");
	
	НомерСтрокиДляПолучения = 2;
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьСтрокуМассива(ПараметрыПодключенияКСерверуRedis, Ключ, НомерСтрокиДляПолучения);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Строка")
		.Равно(ТестовыйМассив[НомерСтрокиДляПолучения])
	;
	
КонецПроцедуры

Процедура ПолучитьСтрокуМассива_КлючНеЗадан() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	НомерСтрокиДляПолучения = 1;

	// Специально ничего не записываю в Redis
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьСтрокуМассива(ПараметрыПодключенияКСерверуRedis, Ключ, НомерСтрокиДляПолучения);

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.Равно(Неопределено)
	;
	
КонецПроцедуры

Процедура ПолучитьСтрокуМассива_ЗначениеНеМассив() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоваяСтрока";
	ТестоваяСтрока = "ТестовоеЗначение";
	
	НомерСтрокиДляПолучения = 1;

	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоваяСтрока);

	// Получение данных из Redis не описываю т.к. для данных условий предусмотрено вызов исключения

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(Redis_ОсновныеФункции)
		.Метод("ПолучитьСтрокуМассива")
			.Параметр(ПараметрыПодключенияКСерверуRedis)
			.Параметр(Ключ)
			.Параметр(НомерСтрокиДляПолучения)
		.ВыбрасываетИсключение(СтрШаблон("Значение в БД Redis для ключа ""%1"" не являеся массивом", Ключ))
	;
	
КонецПроцедуры

Процедура ПолучитьСтрокуМассива_НекорретныйИндекс() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	ТестовыйМассив.Добавить("ЗначениеМассива2");
	ТестовыйМассив.Добавить("ЗначениеМассива3");
	
	НомерСтрокиДляПолучения = 5;
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьСтрокуМассива(ПараметрыПодключенияКСерверуRedis, Ключ, НомерСтрокиДляПолучения);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.Равно(Неопределено)
	;
	
КонецПроцедуры

Процедура УдалитьСтрокиМассива_ОднаСтрока() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	ТестовыйМассив.Добавить("ЗначениеМассива2");
	ТестовыйМассив.Добавить("ЗначениеМассива3");
	
	НомерСтрокиДляУдаления = 2;
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатУдаления = Redis_ОсновныеФункции.УдалитьСтрокиМассива(ПараметрыПодключенияКСерверуRedis, Ключ, 0, ТестовыйМассив[1]);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьМассив(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатУдаления)
		.ИмеетТип("Число")
		.Равно(1)
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(2)
		.Содержит(ТестовыйМассив[0])
		.Содержит(ТестовыйМассив[2])
	;
	
КонецПроцедуры

Процедура УдалитьСтрокиМассива_НесколькоСтрок() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	ТестовыйМассив.Добавить("ЗначениеДляУдаления");
	ТестовыйМассив.Добавить("ЗначениеМассива3");
	ТестовыйМассив.Добавить("ЗначениеДляУдаления");
	ТестовыйМассив.Добавить("ЗначениеДляУдаления");
	
	НомерСтрокиДляУдаления = 2;
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатУдаления = Redis_ОсновныеФункции.УдалитьСтрокиМассива(ПараметрыПодключенияКСерверуRedis, Ключ, 0, ТестовыйМассив[1]);

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьМассив(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатУдаления)
		.ИмеетТип("Число")
		.Равно(3)
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(2)
		.Содержит(ТестовыйМассив[0])
		.Содержит(ТестовыйМассив[2])
	;
	
КонецПроцедуры

Процедура УдалитьСтрокиМассива_НечегоУдалять() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = Новый Массив;
	ТестовыйМассив.Добавить("ЗначениеМассива1");
	ТестовыйМассив.Добавить("ЗначениеМассива2");
	ТестовыйМассив.Добавить("ЗначениеМассива3");
	
	НомерСтрокиДляУдаления = 2;
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);

	РезультатУдаления = Redis_ОсновныеФункции.УдалитьСтрокиМассива(ПараметрыПодключенияКСерверуRedis, Ключ, 0, "ЗначениеДляУдаления");

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьМассив(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатУдаления)
		.ИмеетТип("Число")
		.Равно(0)
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(3)
		.Содержит(ТестовыйМассив[0])
		.Содержит(ТестовыйМассив[1])
		.Содержит(ТестовыйМассив[2])
	;
	
КонецПроцедуры

Процедура СоздатьБольшойМассив(КоличествоДанных) Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыйМассив = ЮТест.Контекст().Значение("Данные");

	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыйМассив);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;
	
КонецПроцедуры

Процедура ПолучитьБольшойМассив(КоличествоДанных) Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	РезультатУстановки = ЮТест.Контекст().Значение("РезультатУстановки");
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьМассив(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;
	
	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(КоличествоДанных)
	;

КонецПроцедуры

#КонецОбласти

#Область РаботаСХэшТаблицами

Процедура СохранитьХэшТаблицуСПустымиЗначениями_ОдноПустое() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоввяСтруктура";

	ТестоввяСтруктура = Новый Структура;
	ТестоввяСтруктура.Вставить("Ключ1", "ЗначениеСтруктуры1");
	ТестоввяСтруктура.Вставить("Ключ2", Неопределено);
	ТестоввяСтруктура.Вставить("Ключ3", "ЗначениеСтруктуры3");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоввяСтруктура);

	РезультатПолучения = Redis_ОсновныеФункции.КоличествоПолейХэшТаблицы(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Число")
		.Равно(2)
	;
	
КонецПроцедуры

Процедура СохранитьХэшТаблицуСПустымиЗначениями_ВсеПустые() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоввяСтруктура";

	ТестоввяСтруктура = Новый Структура;
	ТестоввяСтруктура.Вставить("Ключ1", Неопределено);
	ТестоввяСтруктура.Вставить("Ключ2", Неопределено);
	ТестоввяСтруктура.Вставить("Ключ3", Неопределено);
	
	ЮТест.ОжидаетЧто(Redis_ОсновныеФункции)
		.Метод("УстановитьЗначение")
			.Параметр(ПараметрыПодключенияКСерверуRedis)
			.Параметр(Ключ)
			.Параметр(ТестоввяСтруктура)
		.ВыбрасываетИсключение("Структура должна содержать хотя бы одно значение.")
	;

	РезультатПолучения = Redis_ОсновныеФункции.КоличествоПолейХэшТаблицы(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Неопределено")
	;
	
КонецПроцедуры

Процедура ПолучитьХэшТаблицу() Экспорт

	// TODO:

КонецПроцедуры

Процедура КоличествоПолейХэшТаблицы() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоввяСтруктура";

	ТестоввяСтруктура = Новый Структура;
	ТестоввяСтруктура.Вставить("Ключ1", "ЗначениеСтруктуры1");
	ТестоввяСтруктура.Вставить("Ключ2", "ЗначениеСтруктуры2");
	ТестоввяСтруктура.Вставить("Ключ3", "ЗначениеСтруктуры3");
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоввяСтруктура);

	РезультатПолучения = Redis_ОсновныеФункции.КоличествоПолейХэшТаблицы(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Число")
		.Равно(3)
	;
	
КонецПроцедуры

Процедура ПоляХэшТаблицы() Экспорт

	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоввяСтруктура";

	ТестоввяСтруктура = Новый Структура;
	ТестоввяСтруктура.Вставить("Ключ1", "ЗначениеСтруктуры1");
	ТестоввяСтруктура.Вставить("Ключ2", "ЗначениеСтруктуры2");
	ТестоввяСтруктура.Вставить("Ключ3", "ЗначениеСтруктуры3");
	
	МассивПолейДляСравнения = ПолучитьМассивПолейСтруктуры(ТестоввяСтруктура);
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоввяСтруктура);

	РезультатПолучения = Redis_ОсновныеФункции.ПоляХэшТаблицы(ПараметрыПодключенияКСерверуRedis, Ключ);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(3)
		.Содержит(МассивПолейДляСравнения[0])
		.Содержит(МассивПолейДляСравнения[1])
		.Содержит(МассивПолейДляСравнения[2])
	;
	
КонецПроцедуры

Процедура ЗначениеПоляХэшТаблицы() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоввяСтруктура";

	ТестоввяСтруктура = Новый Структура;
	ТестоввяСтруктура.Вставить("Ключ1", "ЗначениеСтруктуры1");
	ТестоввяСтруктура.Вставить("Ключ2", "ЗначениеСтруктуры2");
	ТестоввяСтруктура.Вставить("Ключ3", "ЗначениеСтруктуры3");

	МассивПолейДляСравнения = ПолучитьМассивПолейСтруктуры(ТестоввяСтруктура);
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоввяСтруктура);

	РезультатПолучения = Redis_ОсновныеФункции.ЗначениеПоляХэшТаблицы(ПараметрыПодключенияКСерверуRedis, Ключ, МассивПолейДляСравнения[2]);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Строка")
		.Равно(ПолучитьЗначениеПоКлючу(ТестоввяСтруктура, МассивПолейДляСравнения[2]))
	;
	
КонецПроцедуры

Процедура УдалитьПоляХэшТаблицы() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестоввяСтруктура";

	ТестоввяСтруктура = Новый Структура;
	ТестоввяСтруктура.Вставить("Ключ1", "ЗначениеСтруктуры1");
	ТестоввяСтруктура.Вставить("Ключ2", "ЗначениеСтруктуры2");
	ТестоввяСтруктура.Вставить("Ключ3", "ЗначениеСтруктуры3");
	ТестоввяСтруктура.Вставить("Ключ4", "ЗначениеСтруктуры4");
	ТестоввяСтруктура.Вставить("Ключ5", "ЗначениеСтруктуры5");

	МассивПолейДляСравнения = ПолучитьМассивПолейСтруктуры(ТестоввяСтруктура);
	
	МассивПолейДляУдаления = Новый Массив;
	МассивПолейДляУдаления.Добавить(МассивПолейДляСравнения[2]);
	МассивПолейДляУдаления.Добавить(МассивПолейДляСравнения[3]);
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьЗначение(ПараметрыПодключенияКСерверуRedis, Ключ, ТестоввяСтруктура);

	РезультатПолучения = Redis_ОсновныеФункции.УдалитьПоляХэшТаблицы(ПараметрыПодключенияКСерверуRedis, Ключ, МассивПолейДляУдаления);

	РезультатПроверки = Redis_ОсновныеФункции.ПоляХэшТаблицы(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Число")
		.Равно(МассивПолейДляУдаления.Количество())
	;
	
	ЮТест.ОжидаетЧто(РезультатПроверки)
		.ИмеетТип("Массив")
		.ИмеетДлину(ТестоввяСтруктура.Количество() - МассивПолейДляУдаления.Количество())
		.Содержит(МассивПолейДляСравнения[0])
		.Содержит(МассивПолейДляСравнения[1])
		.НеСодержит(МассивПолейДляСравнения[2])
		.НеСодержит(МассивПолейДляСравнения[3])
		.Содержит(МассивПолейДляСравнения[4])
	;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСJson

Процедура УстановитьИПолучитьJson() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	
	ТестоваяСтруктура = Новый Структура("Тест1, Тест2",
		"ТестовоеЗначение1", "ТестовоеЗначение2");
	
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(
		Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJson, ТестоваяСтруктура);
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьJson(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson);
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьJson(ПараметрыПодключенияКСерверуRedis, Ключ);

	СтруктураИзRedis = ПрочитатьJSON(РезультатПолучения);
	СтруктурыРавны = СтруктурыРавны(ТестоваяСтруктура, СтруктураИзRedis);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("ЧтениеJSON")
	;

	ЮТест.ОжидаетЧто(СтруктурыРавны)
		.ЭтоИстина()
	;
	
КонецПроцедуры

Процедура УстановитьИПолучитьМногострочныйJson() Экспорт

	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	
	ТестоваяСтруктура = Новый Структура("Тест1, Тест2",
		"ТестовоеЗначение1", "ТестовоеЗначение2");
	
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
	ЗаписатьJSON(ЗаписьJson, ТестоваяСтруктура);
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьJson(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson);
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьJson(ПараметрыПодключенияКСерверуRedis, Ключ);

	СтруктураИзRedis = ПрочитатьJSON(РезультатПолучения);
	СтруктурыРавны = СтруктурыРавны(ТестоваяСтруктура, СтруктураИзRedis);

	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("ЧтениеJSON")
	;

	ЮТест.ОжидаетЧто(СтруктурыРавны)
		.ЭтоИстина()
	;

КонецПроцедуры

Процедура УстановитьJsonДляПути_Число() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	
	ТестоваяСтруктура = Новый Структура("Тест1, Тест2",
		"ТестовоеЗначение1", "ТестовоеЗначение2");
	
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(
		Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJson, ТестоваяСтруктура);
	
	РезультатУстановкиКорня = Redis_ОсновныеФункции.УстановитьJson(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson);

	РезультатУстановкиДляПути = Redis_ОсновныеФункции.УстановитьJsonДляПути(ПараметрыПодключенияКСерверуRedis, Ключ, 3, "Тест2");

	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьJson(ПараметрыПодключенияКСерверуRedis, Ключ);

	СтруктураИзRedis = ПрочитатьJSON(РезультатПолучения);

	ЮТест.ОжидаетЧто(РезультатУстановкиКорня)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатУстановкиДляПути)
		.ЭтоИстина()
	;
	
	ЮТест.ОжидаетЧто(СтруктураИзRedis)
		.ИмеетТип("Структура")
		.ИмеетСвойство("Тест2")
		.Свойство("Тест2")
			.ИмеетТип("Число")
			.Равно(3)
	;
	
КонецПроцедуры

Процедура УстановитьJsonДляПути_Структура() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	
	ТестоваяСтруктура = Новый Структура("Тест1, Тест2",
		"ТестовоеЗначение1", "ТестовоеЗначение2");
	
	ЗаписьJson_ТестоваяСтруктура = Новый ЗаписьJSON();
	ЗаписьJson_ТестоваяСтруктура.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJson_ТестоваяСтруктура, ТестоваяСтруктура);
	
	КорневаяСтруктура = Новый Структура("Поле1, Поле2",
		"ЗначениеДляПоля1", "ЗначениеДляПоля2");
	
	ЗаписьJson_КорневаяСтруктура = Новый ЗаписьJSON();
	ЗаписьJson_КорневаяСтруктура.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJson_КорневаяСтруктура, КорневаяСтруктура);
	
	РезультатУстановкиКорня = Redis_ОсновныеФункции.УстановитьJson(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson_КорневаяСтруктура);

	РезультатУстановкиДляПути = Redis_ОсновныеФункции.УстановитьJsonДляПути(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson_ТестоваяСтруктура, "Поле2");
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьJson(ПараметрыПодключенияКСерверуRedis, Ключ);

	СтруктураИзRedis = ПрочитатьJSON(РезультатПолучения);

	ЮТест.ОжидаетЧто(РезультатУстановкиКорня)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатУстановкиДляПути)
		.ЭтоИстина()
	;
	
	ЮТест.ОжидаетЧто(СтруктураИзRedis)
		.ИмеетТип("Структура")
		.ИмеетСвойство("Поле2")
		.Свойство("Поле2")
			.ИмеетТип("Структура")
			.ИмеетСвойство("Тест1")
			.ИмеетСвойство("Тест2")
		.Свойство("Поле2.Тест1").Равно("ТестовоеЗначение1")
		.Свойство("Поле2.Тест2").Равно("ТестовоеЗначение2")
	;
	
КонецПроцедуры

Процедура УстановитьJsonДляПути_КореньОтсутствует_Число() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	Путь = "Поле1";
	
	// Путь "Поле1" отсутствует
	
	ЮТест.ОжидаетЧто(Redis_ОсновныеФункции)
		.Метод("УстановитьJsonДляПути")
			.Параметр(ПараметрыПодключенияКСерверуRedis)
			.Параметр(Ключ)
			.Параметр(3)
			.Параметр(Путь)
		.ВыбрасываетИсключение(СтрШаблон("Для значения %1 не определен путь %2", Ключ, Путь))
	;
	
КонецПроцедуры

Процедура УстановитьJsonДляПути_КореньОтсутствует_Структура() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	Путь = "Поле1";
	
	ТестоваяСтруктура = Новый Структура("Тест1", "ТестовоеЗначение1");
	
	ЗаписьJson_ТестоваяСтруктура = Новый ЗаписьJSON();
	ЗаписьJson_ТестоваяСтруктура.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJson_ТестоваяСтруктура, ТестоваяСтруктура);

	// Путь "Поле1" отсутствует
	
	ЮТест.ОжидаетЧто(Redis_ОсновныеФункции)
		.Метод("УстановитьJsonДляПути")
			.Параметр(ПараметрыПодключенияКСерверуRedis)
			.Параметр(Ключ)
			.Параметр(ЗаписьJson_ТестоваяСтруктура)
			.Параметр(Путь)
		.ВыбрасываетИсключение(СтрШаблон("Для значения %1 не определен путь %2", Ключ, Путь))
	;
		
КонецПроцедуры

Процедура УстановитьJsonДляПути_ГлубокаяВложенность_Число() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	
	ТестоваяСтруктура = Новый Структура("Тест1, Тест2",
		Новый Структура("Поле1_1", "ТестовоеЗначение1_1"), "ТестовоеЗначение2");
	
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(
		Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJson, ТестоваяСтруктура);
	
	РезультатУстановкиКорня = Redis_ОсновныеФункции.УстановитьJson(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson);
	
	РезультатУстановкиДляПути = Redis_ОсновныеФункции.УстановитьJsonДляПути(ПараметрыПодключенияКСерверуRedis, Ключ, 3, "Тест1.Поле1_1");
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьJson(ПараметрыПодключенияКСерверуRedis, Ключ);

	СтруктураИзRedis = ПрочитатьJSON(РезультатПолучения);

	ЮТест.ОжидаетЧто(РезультатУстановкиКорня)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатУстановкиДляПути)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(СтруктураИзRedis)
		.ИмеетТип("Структура")
		.ИмеетСвойство("Тест1")
		.Свойство("Тест1")
			.ИмеетТип("Структура")
			.ИмеетСвойство("Поле1_1")
		.Свойство("Тест1.Поле1_1").Равно(3)
	;
	
КонецПроцедуры

Процедура УстановитьJsonДляПути_ГлубокаяВложенностьОтсутствует_Число() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	Путь = "Тест1.Поле1_1";
	
	ТестоваяСтруктура = Новый Структура("Тест1, Тест2",
		"ТестовоеЗначение1", "ТестовоеЗначение2");
	
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(
		Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJson, ТестоваяСтруктура);
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьJson(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson);
	
	// Часть пути "Тест1" есть, но "Поле1_1" отсутствует
	
	ЮТест.ОжидаетЧто(Redis_ОсновныеФункции)
		.Метод("УстановитьJsonДляПути")
			.Параметр(ПараметрыПодключенияКСерверуRedis)
			.Параметр(Ключ)
			.Параметр(3)
			.Параметр(Путь)
		.ВыбрасываетИсключение(СтрШаблон("Для значения %1 не определен путь %2", Ключ, Путь))
	;
	
КонецПроцедуры

Процедура ПолучитьJsonДляПути() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	
	ТестоваяСтруктура = Новый Структура("Тест1, Тест2",
		"ТестовоеЗначение1", "ТестовоеЗначение2");
	
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(
		Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJson, ТестоваяСтруктура);
	
	РезультатУстановкиКорня = Redis_ОсновныеФункции.УстановитьJson(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson);
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьJsonДляПути(ПараметрыПодключенияКСерверуRedis, Ключ, "Тест2");
	
	ЗначениеИзRedis = ПрочитатьJSON(РезультатПолучения);
	
	ЮТест.ОжидаетЧто(РезультатУстановкиКорня)
		.ЭтоИстина()
	;
	
	ЮТест.ОжидаетЧто(ЗначениеИзRedis)
		.ИмеетТип("Строка")
		.Равно(ТестоваяСтруктура.Тест2)
	;
	
КонецПроцедуры

Процедура ПолучитьJsonДляПути_КореньОтсутствует() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	Путь = "Поле1";
	
	// Ключ "ТестовыйJson" отсутствует
	// Путь "Поле1" отсутствует
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьJsonДляПути(ПараметрыПодключенияКСерверуRedis, Ключ, Путь);
	
	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Неопределено")
	;
	
КонецПроцедуры

Процедура ПолучитьJsonДляПути_ГлубокаяВложенностьОтсутствует() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйJson";
	Путь = "Тест1.Поле1_1";
	
	ТестоваяСтруктура = Новый Структура("Тест1, Тест2",
		"ТестовоеЗначение1", "ТестовоеЗначение2");
	
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(
		Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJson, ТестоваяСтруктура);
	
	РезультатУстановки = Redis_ОсновныеФункции.УстановитьJson(ПараметрыПодключенияКСерверуRedis, Ключ, ЗаписьJson);
	
	// Часть пути "Тест1" есть, но "Поле1_1" отсутствует
	
	ЮТест.ОжидаетЧто(Redis_ОсновныеФункции)
		.Метод("ПолучитьJsonДляПути")
			.Параметр(ПараметрыПодключенияКСерверуRedis)
			.Параметр(Ключ)
			.Параметр(Путь)
		.ВыбрасываетИсключение(СтрШаблон("Для значения %1 не определен путь %2", Ключ, Путь))
	;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСТранзакциями



#КонецОбласти

#Область РаботаСStreams



#КонецОбласти

#Область РаботаСУпорядоченнымиМножествами

Процедура ДобавитьПолучитьЭлементыМножества() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыеДанные = Новый Массив;
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(1, "Батон Нарезной"));
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(5, "Батон Кольцовский"));
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(2, "Батон Никитинский"));
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(6, "Батон Молочный"));
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(3, "Плюшка с маком"));
	
	РезультатУстановки = Redis_ОсновныеФункции.ДобавитьЭлементыВУпорядоченноеМножество(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыеДанные);
	
	РезультатПолучения = Redis_ОсновныеФункции.ПолучитьЭлементыУпорядоченногоМножества(ПараметрыПодключенияКСерверуRedis, Ключ);
	
	ЮТест.ОжидаетЧто(РезультатУстановки)
		.ЭтоИстина()
	;

	ЮТест.ОжидаетЧто(РезультатПолучения)
		.ИмеетТип("Массив")
		.ИмеетДлину(5)
		.Свойство("[0]")
			.ИмеетТип("Строка")
			.Равно("Батон Нарезной")
		.Свойство("[1]")
			.ИмеетТип("Строка")
			.Равно("Батон Никитинский")
		.Свойство("[2]")
			.ИмеетТип("Строка")
			.Равно("Плюшка с маком")
	;
	
КонецПроцедуры

Процедура УдалитьЭлементыМножества() Экспорт
	
	ПараметрыПодключенияКСерверуRedis = ПараметрыПодключенияИзКонтекста();
	Ключ = "ТестовыйМассив";

	ТестовыеДанные = Новый Массив;
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(1, "Батон Нарезной"));
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(5, "Батон Кольцовский"));
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(2, "Батон Никитинский"));
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(6, "Батон Молочный"));
	ТестовыеДанные.Добавить(Redis_Служебный.ЭлементМножества(3, "Плюшка с маком"));
	
	РезультатУстановки = Redis_ОсновныеФункции.ДобавитьЭлементыВУпорядоченноеМножество(ПараметрыПодключенияКСерверуRedis, Ключ, ТестовыеДанные);
	
	

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПодключенияКСерверуRedis()

	// TODO:
	//Возврат Новый Структура("Адрес, Пароль",
	//	"localhost:6379", "REDIS_PASSWORD");
	Возврат Новый Структура("Адрес, Пароль",
		"localhost:6379", "");
	
КонецФункции

Процедура ЗавершитьПроцессыИУдалитьФайлыСервера(ПутьКСерверу)
	
	WMI = ПолучитьCOMОбъект("winmgmts:");
	Процессы = WMI.ExecQuery("SELECT * FROM Win32_Process WHERE Name = 'redis-server.exe'");
	Для Каждого Процесс Из Процессы Цикл
		Процесс.Terminate();
	КонецЦикла;
	
	// Жду 5 секунд
	WshShell = Новый COMОбъект("WScript.Shell");
	WshShell.Run("cmd /c timeout /t 5 /nobreak", 0, Истина);
	WshShell = Неопределено;
	
	Файл = Новый Файл(ПутьКСерверу);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ПутьКСерверу, "*.*");
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыПодключенияИзКонтекста()
	
	Контекст = ЮТест.КонтекстТеста();
	Возврат Новый Структура("Адрес, Пароль",
		Контекст.Адрес, Контекст.Пароль);
	
КонецФункции

#Область РаботаСоСтруктурой

Функция ПолучитьМассивПолейСтруктуры(Структура)
	
	Результат = Новый Массив;
	
	Для каждого ЭлементСтруктуры Из Структура Цикл
		Результат.Добавить(ЭлементСтруктуры.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначениеПоКлючу(Структура, Ключ)
	
	Перем Значение;
	Если Структура.Свойство(Ключ, Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтруктурыРавны(Структура1, Структура2)
	
    Если Структура1.Количество() <> Структура2.Количество() Тогда
        Возврат Ложь;
	КонецЕсли;
	
    Для Каждого Элемент Из Структура1 Цикл
		Если Не Структура2.Свойство(Элемент.Ключ)
			Или Структура1[Элемент.Ключ] <> Структура2[Элемент.Ключ] Тогда
			
            Возврат Ложь;
			
        КонецЕсли;
	КонецЦикла;
	
    Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти