
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыПодключенияКRedis = ПараметрыПодключенияКRedis();
	Если ПустаяСтрока(ПараметрыПодключенияКRedis.Адрес) Тогда
		Возврат;
	КонецЕсли;

	ОбновитьДанныеСервер(ПараметрыПодключенияКRedis);
	
КонецПроцедуры

&НаКлиенте
Процедура КлючиПриАктивизацииСтроки(Элемент)
	
	Данные = Элемент.ТекущиеДанные;
	Если Данные = Неопределено Тогда
		Возврат;
	Конецесли;
	
	Значение = КлючиПриАктивизацииСтрокиСервер(Данные.Наименование);
	
	Если Данные.ТипЗначения = "hash" Тогда
		ЗначениеХэшТаблица.Очистить();
		Для каждого КлючЗначение Из Значение Цикл
			НоваяСтрока = ЗначениеХэшТаблица.Добавить();
			НоваяСтрока.Ключ     = КлючЗначение.Ключ;
			НоваяСтрока.Значение = КлючЗначение.Значение;
		КонецЦикла;
		
		Элементы.СтраницыЗначения.ТекущаяСтраница = Элементы.СтраницаХэшТаблица;
	ИначеЕсли Данные.ТипЗначения = "list" Тогда
		ЗначениеМассив.Очистить();
		Сч = 0;
		Для каждого ЭлементМассива Из Значение Цикл
			НоваяСтрока = ЗначениеМассив.Добавить();
			НоваяСтрока.Индекс   = Сч;
			НоваяСтрока.Значение = ЭлементМассива;
			
			Сч = Сч + 1;
		КонецЦикла;
		
		Элементы.СтраницыЗначения.ТекущаяСтраница = Элементы.СтраницаМассив;
	ИначеЕсли Данные.ТипЗначения = "set" Тогда
		Элементы.СтраницыЗначения.ТекущаяСтраница = Элементы.СтраницаМножество;
	ИначеЕсли Данные.ТипЗначения = "string" Тогда
		ЗначениеСтрока = Значение;
		
		Элементы.СтраницыЗначения.ТекущаяСтраница = Элементы.СтраницаСтрока;
	ИначеЕсли Данные.ТипЗначения = "ReJSON-RL" Тогда
		ЗначениеJson = СформироватьHtmlДляJson(Значение);
		
		Элементы.СтраницыЗначения.ТекущаяСтраница = Элементы.СтраницаJson;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеСервер();
КонецПроцедуры

&НаСервере
Функция  КлючиПриАктивизацииСтрокиСервер(Ключ)
	
	ПараметрыПодключенияКRedis = ПараметрыПодключенияКRedis();
	
	Значение = Redis_ОсновныеФункции.ПолучитьЗначение(ПараметрыПодключенияКRedis, Ключ);
	Если ТипЗнч(Значение) = Тип("ЧтениеJSON") Тогда
		Данные = ПрочитатьJSON(Значение);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, Данные);
		Значение = ЗаписьJSON.Закрыть();
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеСервер(ПараметрыПодключенияКRedis = Неопределено)
	
	Если ПараметрыПодключенияКRedis = Неопределено Тогда
		ПараметрыПодключенияКRedis = ПараметрыПодключенияКRedis();
	КонецЕсли;
	
	Ключи.Очистить();
	
	Соединение = Redis_ОсновныеФункции.ПолучитьСоединение(ПараметрыПодключенияКRedis);
	
	ТекущиеКлючи = Redis_ОсновныеФункции.НайтиКлючиПоШаблону(Соединение, "*");
	Для каждого ТекущийКлюч Из ТекущиеКлючи Цикл
		
		ТипЗначения = Redis_ОсновныеФункции.ТипДанных(Соединение, ТекущийКлюч);
		ВремяЖизни  = Redis_ОсновныеФункции.ПолучитьВремяЖизни(Соединение, ТекущийКлюч);
		
		НоваяСтрока = Ключи.Добавить();
		НоваяСтрока.Наименование = ТекущийКлюч;
		НоваяСтрока.ТипЗначения  = ТипЗначения;
		НоваяСтрока.ВремяЖизни   = ?(ВремяЖизни = 0, "Не задано", ВремяЖизни);
		
		Если ТипЗначения = "hash" Тогда
			НоваяСтрока.ИндексКартинки = 0;
		ИначеЕсли ТипЗначения = "list" Тогда
			НоваяСтрока.ИндексКартинки = 1;
		ИначеЕсли ТипЗначения = "set" Тогда
			НоваяСтрока.ИндексКартинки = 2;
		ИначеЕсли ТипЗначения = "string" Тогда
			НоваяСтрока.ИндексКартинки = 3;
		ИначеЕсли ТипЗначения = "ReJSON-RL" Тогда
			НоваяСтрока.ИндексКартинки = 4;
		КонецЕсли;
		
	КонецЦикла;
	
	Redis_ОсновныеФункции.ЗакрытьСоединение(Соединение);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПодключенияКRedis()
	
	Возврат Новый Структура("Адрес, Пароль",
		АдресСервервRedis, ПарольКСерверуRedis);
	
КонецФункции

&НаКлиенте
Функция СформироватьHtmlДляJson(Значение)

	html = СтрШаблон("<!DOCTYPE html>
	|<html lang=""en"">
	|<head>
	|    <meta charset=""UTF-8"">
	|    <title></title>
	|    <style>
	|		%3
	|        .json-container {
	|            border: 1px solid #ccc;
	|            padding: 15px;
	|            margin: 20px;
	|            background-color: #f9f9f9;
	|        }
	|    </style>
	|</head>
	|<body>
	|    <pre id=""json-result"" class=""json-container""></pre>
	|    <script>
	|        %2
	|    </script>
	|    <script>
	|        const myData = %1;
	|        window.onload = function() {
	|            const outputElem = document.getElementById(""json-result"");
	|            outputElem.innerHTML = syntaxHighlight(JSON.stringify(myData, undefined, 4));
	|        };
	|    </script>
	|</body>
	|</html>
	|", Значение, js(), css());
	
	Возврат html;
	
КонецФункции

&НаКлиенте
Функция js()
	
	Возврат "function syntaxHighlight(json) {
	|	json = json.replace(/&/g, '&amp;').replace(/</g, '&lt;').replace(/>/g, '&gt;');
	|	return json.replace(/(""(\\u[a-zA-Z0-9]{4}|\\[^u]|[^\\""])*""(\s*:)?|\b(true|false|null)\b|-?\d+(?:\.\d*)?(?:[eE][+\-]?\d+)?)/g, function (match) {
	|		var cls = 'number';
	|		if (/^""/.test(match)) {
	|			if (/:$/.test(match)) {
	|				cls = 'key';
	|			} else {
	|				cls = 'string';
	|			}
	|		} else if (/true|false/.test(match)) {
	|			cls = 'boolean';
	|		} else if (/null/.test(match)) {
	|			cls = 'null';
	|		}
	|		return '<span class=""' + cls + '"">' + match + '</span>';
	|	});
	|}";
	
КонецФункции

&НаКлиенте
Функция css()
	
	Возврат ".string { color: green; }
	|.number { color: darkorange; }
	|.boolean { color: blue; }
	|.null { color: magenta; }
	|.key { color: red; }";
	
КонецФункции
